[{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/09/17/psa-ios-8-is-going-to-make-your-iphone-4s-a-good-bit-slower/?ncid=rss_truncated&cps=gravity", "timestamp": "Sep 17th 2014 at 12:45PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "It's common for hardware to perform slower with more powerful software.  iOS 9 won't run on 4S at all.", "timestamp": "2014-10-05T22:42:45.000Z", "author": "LefD Entertainment"}, {"content": "I have a 4s and some of my apps are actually faster now with iOS8", "timestamp": "2014-09-18T16:51:25.000Z", "author": "LanceBowers"}, {"content": "@LanceBowers Should I go ahead with updating my iphone 4s. I have downloaded the software but not installed....", "timestamp": "2014-09-19T05:20:57.000Z", "author": "HappySingh"}, {"content": "You guys need to get a life.These complaints are trivial.it's the end of the world,I have to charge my iPhone twice a day:(>", "timestamp": "2014-09-18T14:36:19.000Z", "author": "SusanTimmer"}, {"content": "@SusanTimmer Reporting apple news is their job. they need to get a life for reporting apple news?", "timestamp": "2014-09-18T17:21:20.000Z", "author": "HughesNet"}, {"content": "@SusanTimmer Yours is not the life I want with my phone.", "timestamp": "2014-10-06T14:40:31.000Z", "author": "Andrea C."}, {"content": "@Andrea C. @SusanTimmer What? It is the end of the world,messages now take 1.83 second to load,before the update it was 1.73 seconds.\nGet a life!", "timestamp": "2014-10-08T16:57:49.000Z", "author": "SusanTimmer"}, {"content": "@SusanTimmer @Andrea C. It's not only the messages, my apps close, battery life is less than half and phone turns off. I have a good life, thanks!", "timestamp": "2014-10-08T18:16:12.000Z", "author": "Andrea C."}, {"content": "I've actually had the opposite happen to me . . . app start-up might be a shade slower, but I know my battery life was MUCH noticeably longer last night after upgrading. I was in iMessage, using the new keyboard tool, back and forth with two people, for over an hour straight - which prior to the upgrade would have taken at least 20% or more off of my phone, and it took maybe 8%.  Siri and iMessage were also much faster.  So, I'll take the little bump I can have while I wait for my new phone to come tomorrow.", "timestamp": "2014-09-18T13:17:34.000Z", "author": "daisymae0"}, {"content": "And pre ios 8 You weren't experiencing the inevitable iPhone battery depletion? The '5' is now 24 months old. Inevitably for me and each phone I've had; Android or iOS, after 14-18 months the 'health' of the battery, it's endure © and ability to hold charge diminishes with time. I've got the 5s & Note 3. My wife the 5. I'm seeing no depletion on the 5s, maybe 20% loss in the 5, the Note 3 ...also a year old has me bewildered. Perhaps I received a bad battery initially and have since bought a pair of replacements. One OEM the other a larger, third party battery. Bought my wife a Mophie case and all is well in the world.\nJust a bit curious though on yours ...JUST using iMessage (& keyboard utility ...did you change back a few times? DL another keyboard, change em out from stock, compare between the two, three or how many you've tried? I'm curious as I said, wig my bride's five. May be time to sell it as she's going to get the 6+, while passing my down to my son.", "timestamp": "2014-09-18T16:36:40.000Z", "author": "anchoragedj"}, {"content": "For the past year, my routine with the iPhone 5 has been: at the gym at 5:20 am; use iPhone for continuous Bluetooth music streaming and an exercise-recording app.  Then at 6:30 am, a drive-home while talking on the phone for 15 minutes.  After breakfast, my iPhone 5 typically had 85% battery remaining (indicated) at 7:00 am. \n\nThis morning (after updating to iOS 8 yesterday), the same routine, my iPhone 5 indicated... 51% !!!\n\nWTH? At this rate of depletion, I'll need to charge my iPhone three times per day!  Eeeeeee.\n\nOtherwise, iOS 8 is working pretty good.  No noticeable slowness.  One weird thing:  when I was on the phone speaking with a person, a pre-set alarm went off -- and I got a gray screen that didn't allow me to do anything.  I had to disconnect the phone call and then was returned to a screen to \"tap' to end the alarm.", "timestamp": "2014-09-18T13:07:54.000Z", "author": "VKMTUAW"}, {"content": "Way to totally misread the Ars Technica story. They are recommending not upgrading due to screen space issues. They are actually saying the its not a huge amount slower, unlike the iPhone 4 and iOS 7. But hey, got to get those clicks haven't you.", "timestamp": "2014-09-17T19:34:48.000Z", "author": "ianc14"}, {"content": "Wow that is not bad, I thought it would be a lot slower. for example iOS 7 slowed the boot time on the iPhone 4 from 38.72 seconds to 4.2 weeks", "timestamp": "2014-09-17T17:09:44.000Z", "author": "Grem"}, {"content": "OMG! OMG! 1.83 instead of 1.73 seconds! OMG!  A good bit? less than a fraction of a second in most cases. Even then... milage may vary depending..\n\nMy 4s in REAL world use I can't tell the difference. Especially when I turn off flashy stuff. it's an older device.. The trade off is by far worth it for extensibility, keyboards, etc.\n\ngreat click bait though.. ", "timestamp": "2014-09-17T16:51:46.000Z", "author": "adrayven"}, {"content": "@adrayven Any device more than 2 years out should be wary of updating.  It happens every single time.  I was a victim of having my iPhone 3G turn to a complete piece of crap back in the day.\nThe numbers may be small, but when it's a device that you use constantly throughout the day, switching back and forth between apps, that fraction of a second adds up and becomes annoying.", "timestamp": "2014-09-17T17:04:03.000Z", "author": "Bieber"}, {"content": "Especially if you're still paying for the phone on a plan! Month to month or like a track phone. But if you're contracted with a family or more than one device plan, you're STILL paying the silly 'built in' subsidy for the phone itself! Maybe $30/$35 in the good ol' USA anyway. After 24 months, once you've 'paid for your phone' ...& you're happy with your carrier, it's time for a new phone, contract, and sale of your older phone. Maybe you're in a part of the world with better oversight of the mobile industry. If so, not the case. If you're here, with Bieber ;)\nJ", "timestamp": "2014-09-18T16:42:49.000Z", "author": "anchoragedj"}], "content": "  When iOS 7 launched, those with an iPhone 4s took issue with the slower application launches and hampered battery life, and at least one of those issues is going to get even worse with an upgrade to iOS 8. Ars Technica put the stopwatch to an iPhone 4s running the gold master of iOS 8 (the version you'll be able to download today), and the numbers aren't pretty. Ars Technica put the stopwatch to an iPhone 4s   Almost everything tested is significantly slower with the new update, but the Calendar, Mail, and Safari apps are hit the hardest. The iPhone 4s also won't be getting the benefits of the Metal API -- the new graphics framework designed to enhance iOS game performance -- which is going to be a bummer for anyone who uses their phone for gaming. This kind of thing isn't new, and with every new release of iOS 8 the oldest supported device regularly experiences some performance issues. The iPhone 4s is three years old at this point, and while iOS 8 is still a good upgrade for the aging phone (it adds both third party keyboard support and widgets, after all), the price you pay for sticking with old hardware will always be dwindling performance. [Chart via Ars Technica] Ars Technica VIEW TAGS VIEW TAGS       SOURCE: http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-… SOURCE: http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-… SOURCE http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-…   ", "source": "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "http://www.tuaw.com/2014/09/17/psa-ios-8-is-going-to-make-your-iphone-4s-a-good-bit-slower/?ncid=rss_truncated&cps=gravity#", "http://www.tuaw.com/tag/ars+technica/", "http://www.tuaw.com/tag/ios/", "http://www.tuaw.com/tag/ios+8/", "http://www.tuaw.com/tag/iphone+4s/", "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/"], "title": "PSA: iOS 8 is going to make your iPhone 4s a good bit slower", "tags": ["ars technica", "ios", "ios 8", "iphone 4s"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/15/is-apple-experiencing-a-problematic-decline-in-software-quality/", "timestamp": "Oct 15th 2014 at 4:00PM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [{"content": "Apple has totally trashed professional software, seemingly unaware that it has customers. After being left stranded, overnight, with 1,000 Pages documents that PseuoPages \"5\" can't load accurately, I began to wonder if Apple uses its own products. That opened my eyes. How can they use Safari internally with without noticing the quirks in its find feature? Why does Mail mark any momentarily previewed message as \"read\"? How does that make sense in an office environment? Then I saw a disk for Microsoft Office on the genius bar labeled \"internal use only.\" I looked in Netcraft and found out that Apple does not use OS X Server for any of its public web sites. What is going on? If Apple thinks its products are great, why aren't they using them?\n\nMaybe this explains why Apple software is being dumbed down and OS X looks like a Saturday-morning cartoon. They think we are all in the fourth grade.\n\nI'm a fanboy in serious vertigo.", "timestamp": "2014-10-16T15:15:48.000Z", "author": "hugmup"}, {"content": "OS X releases are far too frequent.  Make it every two years if you must, but at least make them good.\n\nI actually wish there were more updates for iDevices, fix the issues faster.  But Apple seems more focused on its ugly flat design than anything.", "timestamp": "2014-10-16T13:28:57.000Z", "author": "Bieber"}, {"content": "There have been more bugs recently - at least by my observation - but the solutions people talk about are wrong:\nBigger teams- more developers: Even if Apple could hire more AAA+ software developers, bigger teams result in less output and lower quality. Its simply very difficult to coordinate a large group of people to do something as fluid and complicated as software development. Once a group size exceeds a certain number - which is much lower than most people think - in my experience 10 is getting on to be too large - then productivity and eventually output starts to fall.\n\nSlower Release Cycle: That is no answer either, is it just means that there is a longer period (and more software written) before the developers get feedback (from it going live).\n\nThe only thing they can do is produce less per cycle - and focus more time on testing.", "timestamp": "2014-10-16T13:01:56.000Z", "author": "BarryO"}, {"content": "Latest release loaded on my iPad Air easy peasy. Battery life up. I have NO crap unapproved 3rd party apps. No coincidence.", "timestamp": "2014-10-16T12:23:59.000Z", "author": "eideard"}, {"content": "@eideard\nThere is no jailbreak for 8.0.2,   everyone that is using the \"latest release\"  is using approved apps  from the apple store", "timestamp": "2014-10-16T12:50:17.000Z", "author": "Chuckito"}, {"content": "Been using iPhones and iPads for several years now,  love them. However this latest garbage iOS release has me reconsidering.  Been wanting to get the new iPad that they are announcing today, however I do not want iOS 8 and all its issues on it.  Safari is just plain awful and I've seen video with iOS 8.1 where it is not any better.  I already own a windows PC, an XBOX,   if Microsoft puts out Windows 10 that is a joy to use and works well with a tablet and a phone along with the desktop and the xbox to sync them all together,  it will be tempting to switch. ", "timestamp": "2014-10-16T11:28:11.000Z", "author": "Chuckito"}, {"content": "couldn't agree more. i was excited when icloud drive was announced but trying it out for months with yosemite beta, it's not a finished product. not at all. i wouldn't even call it a \"beta\". it doesn't have enough UI feedback and it's just not working. went back to dropbox, which \"just works\".\n\napple has some really great software out there, finest of their leagues, but trying to catch up with 1-year circles is not helping. relax, r&d more and release stuff when they're ready.", "timestamp": "2014-10-16T09:33:19.000Z", "author": "onur"}, {"content": "I dont think so,people just want to buy Iphone because they like.Check it out.   http://www.casecoco.com/personalized-cases-for-iphone/iphone-6-cases-194", "timestamp": "2014-10-16T08:53:26.000Z", "author": "EdwardJames"}, {"content": "My iPad Air (currently still the latest iPad) crashes with a blue screen of death every 1-2 hours on ios 8 - there are several other users experiencing the same issue on both the iPad Air and iPhone 5s... many of them have got their units replaced and it still happens on installing ios 8... It's been 3 weeks without a resolution and this is a big issue... Even the support people are not cued in to this and are offering hardware replacements for a software bug...\n\nWe have, in the meanwhile, performed several restores and even setup our iPads as new... losing all our old data... the problem persists even without installing a single app from the app store... Crashes happen in Safari and even the Settings app - totally randomly...\n\nios 8 and 8.0.2 are both crap releases... they should have ironed out the problems instead of meeting a deadline... the world could wait another few weeks...\n\nBeing from India where the customer support is fairly limited - it makes it worse...", "timestamp": "2014-10-16T07:51:30.000Z", "author": "sunilthakkar"}, {"content": "@sunilthakkar or at least allow us to rollback to 7.1.2 until they iron out the mess", "timestamp": "2014-10-16T11:16:03.000Z", "author": "Chuckito"}, {"content": "I knew this was happening because I’ve been reporting bugs for 3 years now that haven’t been fixed. My new Macbook Pro has the lousiest WiFi of any computer I’ve ever owned, and the last iOS update took the WiFi down a notch too. Apple has gotten too big for its britches.", "timestamp": "2014-10-16T04:40:43.000Z", "author": "gnarlodious"}, {"content": "@gnarlodious lol notebooks", "timestamp": "2014-10-16T04:47:28.000Z", "author": "The_Jimmy_James"}, {"content": "Apple have made a huge usability paradigm shift with iOS 8.1 and Yosemite, bringing mobile and desktop computing to a more integrated level than ever before. That isn't easy and it's not surprising that little things have slipped through the cracks. If they weren't responding rapidly to fix these issues I'd agree we'd have cause for concern. However they are reacting quickly, they are fixing things in a day or two all while one half of this pair of highly integrated OSs is still unreleased. \n\nCompare and contrast this to what we came to expect from MSFT over the last 20 years where it became IT wisdom that any x.0 release was to be avoided and where it became a standing joke that MSFT's customer's were it's QA dept!!  \n\nLet's keep all this in perspective. We've had our \"Gate du jour\" fun for this year already.  ", "timestamp": "2014-10-16T04:24:41.000Z", "author": "hprice"}, {"content": "Should we judge articles for accuracy of premises? Then the quality is clearly suffering.\nSure, a glitch or two, but imagine being able to criticize a major release in the first weeks, and all anyone can do is gripe about a few hiccups?\nAnyone remember that windows os? Don't even try to use it in the first 6 months, let alone first few weeks. Oh, and do we mention that most people skip version after version after version? Is android updated regularly? Oh, by the number of people on really old versions, I guess not.\nIs Apple perfect on day one? No, but is that the new standard for anyone?\nI would say, that ios is a great success with fewer than normal problems. Works great on my 5s, and my iPad v3. Has anyone tried handing a phone call off between the iPhone and iPad........really cool.\nIn short, if you are dissatisfied, there are other vendors out there, or you could wait a few weeks, until the bugs are worked out.", "timestamp": "2014-10-16T04:06:52.000Z", "author": "Gkw5341"}, {"content": "In 2013, Mavericks was nearly a PR release. \"Let's come out with a new version just to say we did.\" They were focused on iOS7. This time around, the focus is on Yosemite.\n\nIt's pretty clear that I either missed out on some crappy releases, or that this is all just someone's overactive imagination because I ran every OS and system software release from 6.0.8 to 10.5.8, and ran most of Apple's first-party software, too. There's been shitty releases here and there. Should we bring up System 4? Maybe OS 8.5?\n\nNo, no, I know.\n\nLet's talk about the super high quality of iTunes.\n\nOh no. 8.0.1 was a duff. BFD. How about iOS 7 disabling WiFi on some devices? That's not kooky enough? Don't forget about the <insert busted thing> of <insert OS X or iOS version here>! Remember? We called it shlub-gate or whatever.\n\nThis is an issue with software going from testing to in-the-wild. It happens. When you have 98 hojillion users, your fail rate will be nonzero.\n\nOops.", "timestamp": "2014-10-16T03:47:33.000Z", "author": "The_Jimmy_James"}, {"content": "Touche.  Nice article.  The truth hurts.", "timestamp": "2014-10-16T03:06:01.000Z", "author": "DaveMariano"}, {"content": "I hope Apple gets the message they need to hire more people.", "timestamp": "2014-10-16T02:49:40.000Z", "author": "davidabrooks"}, {"content": "Apple just got Mavericks file sharing working acceptably. Now they're on to another OS version.", "timestamp": "2014-10-16T00:41:57.000Z", "author": "jtedit"}, {"content": "@jtedit I'll say this though, while using the Yosemite public preview, it is by far the most polished beta I've ever used, and in just about every way it was just as polished as Mavericks, which is pretty impressive for a beta.", "timestamp": "2014-10-16T00:54:38.000Z", "author": "MikeAnderson"}, {"content": "@jtedit When they can get suspend/resume reliable as well in Mavericks, that will be great. Or rather, it is no longer obvious that Apple's quality is better than Microsoft's. Certainly Mavericks crashes a lot more than Windows 8.....", "timestamp": "2014-10-16T01:51:18.000Z", "author": "PhilipG"}, {"content": "I wish Apple would remember that 'if it ain't broke, don't fix it'. Apple certainly used to produce some of the best software available but I can only wonder which idiots write it now. Take for example Pages, which was excellent.  I used Pages to create professional interactive e-books, leaflets and magazines. It is now unusable due to a revamp that removed so many useful features and is unstable. I've had to go back to the more complex, but now more reliable Indesign. No wonder Apple now give it for free. It's not worth any more than that. \n\niWeb was well ahead of its time. Why Apple ditched it God only knows. Mail is really unstable and I haven't used iMovie for years. iTunes is just appalling and IOS gives me the shakes because it is so restrictive. I've had to reinstall Mavericks three times due to instability and I don't think that I shall be using Yosemite any time soon. I'm now, for the first time in 25 years considering switching platforms for both desktop, tablet and phone.", "timestamp": "2014-10-16T00:16:35.000Z", "author": "SteveKyte"}, {"content": "@SteveKyte Bye Bye,  have fun in the Windoze/Samstung world.  I don't see any instabilities in Pages or Mavericks.  They aren't perfect, but you sound like a troll.\n\"Nothing works, everything is broken, I have been using Macs for 25 years, I'm switching to XXX\"", "timestamp": "2014-10-16T01:11:25.000Z", "author": "BenG"}, {"content": "@BenG Seems like any criticism of Apple brings you out in a cold sweat. You've obviously not used Pages from day 1 and seen how Apple have mutilated it, nor do you seem familiar with other software I mentioned, nor anything that is non Apple. Just because you're a subservient fan boy doesn't mean that others don't have problems with Apple's software. Apple no longer produce the cutting edge software it used to and has become an all controlling company. What happened to 'Think Different' or perhaps you're too young to know what that was. You're a dream customer (sheep) for Apple. I'll pass on Windows for now but at least I'm open minded enough to look at it. ", "timestamp": "2014-10-16T08:24:42.000Z", "author": "SteveKyte"}, {"content": "@BenG I have been using Macs for 29 years and would never use Windows, but I can tell you the following: the current version of Pages is greatly inferior to the previous one. iPhoto is now so confused, slow and buggy that I loathe it. iTunes is doing far too many jobs, and none of them particularly well. I used to make and edit home movies in iMovie until Apple made it completely user-unfriendly: it used to be so easy, now it’s almost impossible.\n\nWhy is Apple doing this ?", "timestamp": "2014-10-16T11:45:39.000Z", "author": "spjholland"}, {"content": "@spjholland @BenG I think a little perspective is in order.  Apple has never been a perfect company and never will be.  It just happens to be head and shoulders better than the next best.  I have my own list of problems with Apple SW.  \n\nOver the years MS openly declared they made their Mac versions buggy and feature poor in order to punish Mac users.  I never could get Word to be stable after I got more than 2 pictures/graphs inserted.  Pages has been stable for me through 35 page manuals, tutorials, etc.  Not perfect, just 10x better than Word.  I use Keynote for presentations, LibreOffice for spreadsheets, and Vectorworks for CAD. I don't use iMovie or GarageBand.\n\nIt is obvious that Apple has embarked on a new path in computing technology, linking mobile and desktop OSs in a way that requires significant changes in software on both platforms.  MS tried and failed miserably to do this same thing.  This is a tremendous undertaking, years in the making.\n\nApple retrograded the iWorks package to be compatible with IOS, stating they were working to reestablish the functionality in succeeding versions.  They have been nibbling their way back ever since.  Power users were told to use previous versions.\n\nThe current version of Pages works fine for me.  I have never experienced a crash or instability in Pages, just functionality downgrades, which are now back up to satisfactory for me.\n\nWe will see what happens today with the announcement of Yosemite.", "timestamp": "2014-10-16T13:00:57.000Z", "author": "BenG"}, {"content": "iOS I can deal with this on; quite frankly, they had one bad patch, and it was fixed the next day. iOS has been fine. I'm less thrilled with the cumulative bugs and unfinished features on Mac OS X, and Yosemite is the same. It's largely good - but with a lot of niggling problems and half-finished APIs that will simply never be addressed.", "timestamp": "2014-10-15T22:55:07.000Z", "author": "diamondsw"}, {"content": "Annual releases are not a good idea.  While Apple can avoid showstoppers which is amazing given the release schedule,  it's rare to have Mac system so bulletproof that you could leave it unattended all day and know it's going to work.  \n\nI've heard developers say they keep their apps stable by staying away from Apple's beta quality API and wait for them to mature.   Not a compelling testament on Apple's behalf. ", "timestamp": "2014-10-15T22:20:09.000Z", "author": "hmurchison"}, {"content": "Talk all you want about the OS issues, but for me the real sadness lies in the bundled apps. iLife, Mail, Safari, iTunes... all of these apps used to give you solid options for free, just for choosing Apple. One by one they have disappeared, become unusable, unsupported, or just filled with changes for the worse. People are begging for a better iWeb, instead it was killed. iMovie ruined. Mail unstable. iTunes impossible to navigate without going into a rage. Safari killed all my favorite features and introduced nothing but new horrible default settings. And stability? Ha! Apple has clearly abandoned desktop software and it makes the platform far less attractive. When people complained about hardware prices, I used to argue added value software and OS benefits. I no longer have arguments.", "timestamp": "2014-10-15T21:47:29.000Z", "author": "zmatek"}, {"content": "@zmatek Agreed! iTunes is horrible now. Just to show the sidebar you have to click all over the place just to get to the setting etc. it's very clunky.", "timestamp": "2014-10-15T22:10:41.000Z", "author": "LaneJasper"}, {"content": "While iOS 8 has been a bit of a debacle, Yosemite, for a beta/GM release, has been remarkably stable and generally error free -- and this is even with running numerous extensions. Sure a couple of minor glitches here and there, but by and large if the iOS 8 experience mirrored Yosemite, there would be no complaints.\n\nSo, given that Federighi is (if I understand correctly) in charge of software for both, what makes the difference? Why is one so clean and the other so buggy? If I were in charge of Apple, I'd do more than just hire more QA people. I'd create a VP of QA position that was empowered to stop the assembly line, so to speak, on anything that wasn't right, to try to get ahead of all these issues. ", "timestamp": "2014-10-15T17:34:30.000Z", "author": "DR"}, {"content": "@DR I disagree.. I am having ridiculous problems with Yosemite Mail, having to rebuilding indexes and refresh mailboxes 6/7 times a day.  Also, despite being final, iOs 8 has drawing issues transitioning from landscape to portrait that just should not be there.\n\nI do not ever recall problems like this with any Apple software before.", "timestamp": "2014-10-15T21:19:57.000Z", "author": "ubjuris"}, {"content": "@ubjuris @DR The \"fit and finish\" has definitely been lacking. Apple used to be the company that sweated the details, but I've not gotten that sense the last couple releases.", "timestamp": "2014-10-15T22:56:35.000Z", "author": "diamondsw"}], "content": "   release of iOS 8.0.1 fair share of problems       recently wrote I've increasingly had the feeling that Apple is finding it difficult to keep up with all these releases, and that quality is slipping. This generally isn't the case with hardware – no, the iPhone 6 doesn't really bend, unless you apply a lot of pressure to it – but rather with software. Bugs abound; shoddy releases are followed by broken updates. I've increasingly had the feeling that Apple is finding it difficult to keep up with all these releases, and that quality is slipping. This generally isn't the case with hardware – no, the iPhone 6 doesn't really bend, unless you apply a lot of pressure to it – but rather with software. Bugs abound; shoddy releases are followed by broken updates. Echoing this sentiment, Russell Ivanovic wrote the following earlier this month: wrote the following Tim Cook keeps telling us that 'Only Apple' could do the amazing things it does. I just wish that Apple would slow down their breakneck pace and spend the time required to build stable software that their hardware so desperately needs. The yearly release cycles of OS X, iOS, iPhone & iPad are resulting in too many things seeing the light of day that aren't finished yet. Perhaps the world wouldn't let them, perhaps the expectations are now too high, but I'd kill for Snow iOS 8 and Snow Yosemite next year. I'm fairly confident I'm not alone in that feeling. Tim Cook keeps telling us that 'Only Apple' could do the amazing things it does. I just wish that Apple would slow down their breakneck pace and spend the time required to build stable software that their hardware so desperately needs. The yearly release cycles of OS X, iOS, iPhone & iPad are resulting in too many things seeing the light of day that aren't finished yet. Perhaps the world wouldn't let them, perhaps the expectations are now too high, but I'd kill for Snow iOS 8 and Snow Yosemite next year. I'm fairly confident I'm not alone in that feeling. recently compiled a long list       Apple purposefully keeps its software teams small       We had to borrow some key software engineering and QA resources from our Mac OS X team, and as a result we will not be able to release Leopard at our Worldwide Developers Conference in early June as planned. We had to borrow some key software engineering and QA resources from our Mac OS X team, and as a result we will not be able to release Leopard at our Worldwide Developers Conference in early June as planned.     Apple can't deviate from annual iPhone releases           Apple has more users today than ever before       Where does this leave us?         The biggest/richest company in the world, already staffed with many of the smartest and most creative people, shouldn't get so many passes. October 4, 2014  VIEW TAGS VIEW TAGS       SOURCE: http://mjtsai.com/blog/2014/10/11/apples-software-quality-de… SOURCE: http://mjtsai.com/blog/2014/10/11/apples-software-quality-de… SOURCE http://mjtsai.com/blog/2014/10/11/apples-software-quality-de…   ", "source": "http://mjtsai.com/blog/2014/10/11/apples-software-quality-decline/", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://www.tuaw.com/2014/09/24/warning-ios-8-0-1-seems-to-be-breaking-iphones/", "http://www.tuaw.com/2014/09/29/ios-8-0-2-probably-not-apples-finest-update/", "http://www.mcelhearn.com/is-apple-trying-to-do-too-much-too-quickly/", "http://rustyshelf.org/2014/10/01/it-just-works/", "http://mjtsai.com/blog/2014/10/11/apples-software-quality-decline/", "https://twitter.com/danielpunkass/status/518245402563575808", "http://www.tuaw.com/2014/10/15/is-apple-experiencing-a-problematic-decline-in-software-quality/#", "http://www.tuaw.com/tag/IOS/", "http://www.tuaw.com/tag/ios+8/", "http://www.tuaw.com/tag/opinion/", "http://www.tuaw.com/tag/os+x/", "http://mjtsai.com/blog/2014/10/11/apples-software-quality-decline/"], "title": "Is Apple experiencing a problematic decline in software quality?", "tags": ["IOS", "ios 8", "opinion", "os x"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/13/waterfield-designs-spinn-case-for-iphone-6-plus-review-and-give/", "timestamp": "Oct 13th 2014 at 6:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [{"content": "“About my only complaint about the rugged Spinn Case is the price, which seems to be somewhat higher than I'd expect for a few pieces of leather sewn together.” I take it you don’t buy many things that are hand-crafted", "timestamp": "2014-10-16T06:05:38.000Z", "author": "Eric_WVGG"}, {"content": " I just bought a new iPhone 6 at http://www.giveawaylab.com/p/product-catalog.html when I broke my iPhone 5 accidentally when I was taking a bath the phone just went nuts when it was spilled with water. Luckily I have my new one now and was really satisfied with the new features of iPhone 6 it was a blessing in disguise.", "timestamp": "2014-10-15T07:17:46.000Z", "author": "NightieRider"}, {"content": "Nice, though that headphone cable is going to start to separate and fray with the bend if they keep it that way.", "timestamp": "2014-10-14T16:43:11.000Z", "author": "HughesNet"}, {"content": "Hmmm. If you bang that snap could it drive the back into your phone screen? Plus you are snapping it all day, is it straight leather behind it, or the back of the metal snap? ", "timestamp": "2014-10-14T15:33:13.000Z", "author": "toastist"}], "content": "  We're finally starting to see a number of iPhone 6/6 Plus-specific cases appearing on the market, and today we're going to review one from Waterfield Designs of San Francisco. The Spinn Case (US$59) is the latest in an all-leather sleeve for Apple's larger smartphones, but with a literal twist. Waterfield Designs Spinn Case Design Design If you like all-natural materials, you'll love the Spinn Case. It's made of full grain leather, stitched ruggedly around the perimeter, with a flap that goes over the top of the phone that's secured by a \"pin and slit\" closure. The bottom is left wide open, perfect for attaching your earpods or charging your phone. The Spinn feature is the big deal here: it's a patent-pending spool made of the same leather that you simply wrap your earpods around. Spinn's great for making sure that your cables don't get tangled up while you're not wearing them - much better than just stuffing them into a pocket!   Waterfield Designs also offers this case with a belt clip ($10 extra) and you can get it for either naked iPhone 6/6 Plus models (no case) or those with a thin case installed. The leather comes in three finishes: Black, Grizzly, and Chocolate. Functionality Functionality Hey. It's a sleeve. Your phone goes into it, the top flap flops over the top and can be closed with that handy little closure, and the rest is history. If you drop your iPhone, it will probably survive, although this isn't one of those three-layer TPU/PTE/Silicone mashups. In our plastic, glass and aluminum world, I really appreciate the natural look and feel of something like the Spinn Case. It's going to wear with age and look even better after a few years.   Conclusion Conclusion About my only complaint about the rugged Spinn Case is the price, which seems to be somewhat higher than I'd expect for a few pieces of leather sewn together. If you're in the market for a protective sleeve for an iPhone 6 or 6 Plus, perhaps with a belt clip and definitely with an innovative way to keep your earbuds from tangling, this is a solid bet. Rating: 3-1/2 stars out of 4 stars possible Rating: 3-1/2 stars out of 4 stars possible    Giveaway And now it's time to give away our review sample, which is made for a naked iPhone 6 Plus and has that lovely Grizzly (dark brown) finish -- but no belt loop. Here are the rules for the giveaway: Open to legal US residents of the 50 United States, the District of Columbia and Canada (excluding Quebec) who are 18 and older. To enter, fill out the form below completely and click or tap the Submit button. The entry must be made before October 14, 2014 11:59PM Eastern Daylight Time. You may enter only once. One winner will be selected in a random drawing and will receive a Waterfield Designs Spinn Case valued at $59. Click Here for complete Official Rules. Click Here for complete Official Rules. If the form below is not visible, please click here to enter. please click here to enter Loading... Loading... VIEW TAGS VIEW TAGS           SOURCE: http://www.sfbags.com/collections/iphone-cases/products/ipho… SOURCE: http://www.sfbags.com/collections/iphone-cases/products/ipho… SOURCE http://www.sfbags.com/collections/iphone-cases/products/ipho…   ", "source": "http://www.sfbags.com/collections/iphone-cases/products/iphone-spinn-case", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://sfbags.com/", "http://www.sfbags.com/collections/iphone-cases/products/iphone-spinn-case", "http://www.tuaw.com/giveaway-us-canada/", "https://docs.google.com/forms/d/1RJdV1dRLOavLfP4lva4mMT57E9buJGeB41LnnPTEidU/viewform?usp=send_form", "http://www.tuaw.com/2014/10/13/waterfield-designs-spinn-case-for-iphone-6-plus-review-and-give/#", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/giveaway/", "http://www.tuaw.com/tag/iPhone/", "http://www.tuaw.com/tag/iphone+6/", "http://www.tuaw.com/tag/iphone+6+plus/", "http://www.tuaw.com/tag/review/", "http://www.tuaw.com/tag/spinn+case/", "http://www.tuaw.com/tag/waterfield+designs/", "http://www.sfbags.com/collections/iphone-cases/products/iphone-spinn-case"], "title": "Waterfield Designs Spinn Case for iPhone 6 Plus: Review and giveaway", "tags": ["features", "giveaway", "iPhone", "iphone 6", "iphone 6 plus", "review", "spinn case", "waterfield designs"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/15/pulse-by-sengled-ios-controllable-led-lights-with-speakers-by/", "timestamp": "Oct 15th 2014 at 6:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [{"content": "as Sarah answered I'm startled that some one able to get..... Ｗ­­Ｗ­­Ｗ．M­­­O­­­N­­­­E­­­Y­­K­­­I­­N．Ｃ­­Ｏ­­Ｍ", "timestamp": "2014-10-16T12:46:10.000Z", "author": "MckenneyShirley"}, {"content": "New design.  case for Iphone 6/+  if any one need it.  http://www.casecoco.com/personalized-cases-for-iphone/iphone-6-cases-194  check it out.", "timestamp": "2014-10-16T08:56:14.000Z", "author": "EdwardJames"}, {"content": "that's a clever design...but they only get away with this pricing by being one of the first entrants. I wonder if I had bout 6 of these guys around the room, some closer to me and some 20 ft away, if the music would be in sync?", "timestamp": "2014-10-16T02:32:54.000Z", "author": "Truffol"}, {"content": "No mention of HomeKit? If I have to fire up their specific app to turn the lights on and off then I'm not interested. And I can't turn them off at the wall because then the speakers are cut off too.", "timestamp": "2014-10-16T00:11:54.000Z", "author": "craigalanstanton"}], "content": "Smartphone-controlled LED lights with integrated speakers are nothing new, but they've always had some shortcomings. For one thing, there was always the speakers, which seemed to be an added afterthought and never provided decent stereo sound. Sengled's new Pulse Dimmable LED lights with wireless speakers (US$179 for a pair) are the first to provide a master/satellite setup that ensures true stereo sound in a bright and energy-efficient light fixture.    Sengled's new Pulse Dimmable LED lights with wireless speakers  Specifications US Version: works in any standard E26 socket Power Consumption: 15W typical, 30W peak Dimensions: 5.46\" height x 3.86\" diameter Weight: 14.82 ounces Audio System Power: 13 watts, with 1.75\" full-range high-fidelity speaker, 100 Hz - 20 kHz frequency response Bluetooth Standard: v2.1 + EDR, with A2DP, AVRCP, SPP profiles Design Design  Where some of the early LED light/speaker combos had laughably bad designs, Sengled obviously put some thought into the design of the Pulse. The lights have a tympani-like shape, with a gentle flare and scalloping that's reminiscent of a tulip. There are two exterior finishes, pewter and candy apple red.     Being almost 4 inches in diameter, you'll need to put some thought into what fixtures you put the lights into. Sengled's website shows the lights going into a recessed ceiling fixture, which would be perfect for this design.  The lights are set up as a master device and a satellite device that can placed up to 100 feet apart (line of sight). Your iPhone or iPad, running the Pulse by Sengled app (free), can stream just about any music source directly to the master device. It then beams the stereo channel to the satellites (you will eventually be able to have up to eight speaker bulbs) over a 5 GHz wireless network. Pulse by Sengled  Functionality Functionality  Installation of the Pulse lights is as simple as screwing a light bulb into a socket. Once the light is installed and power turned on, you fire up the app, which displays a welcome page while searching for the master light. Once connected, the app displays a control screen with two tabs -- \"Lights\" and \"Sound\".    Each tab has a \"dial\" that you can swipe in a circle to control the intensity of the light or the volume of sound. It's a very intuitive UI, much easier to understand than some of the bizarre apps I've seen with other light/speaker combos.  The app also includes an \"equalizer\", which is actually just 7 sound effect settings: normal, pop, jazz, classical, rock, vocal and movie. The sound from the speakers, as you'd expect, is quite a bit better than what I've heard from other light/speaker combos on the market. While it can't compete with dedicated wireless speaker systems, the sound from the JBL speakers is fairly impressive.  Conclusion Conclusion  Pulse by Sengled is a well-designed light/speaker combo that addresses the poor audio quality associated with many similar products. The price is reasonable compared to other less-capable speaker lights, and the design is attractive and functional. Coupled with an easy-to-use iOS app, Pulse is definitely worth considering if you're in the market for this type of combination Bluetooth accessory.  Rating: 3-1/2 stars out of 4 stars possible Rating: 3-1/2 stars out of 4 stars possible   VIEW TAGS VIEW TAGS           SOURCE: http://sengledplus.com/products/integrated-led-light-bluetoo… SOURCE: http://sengledplus.com/products/integrated-led-light-bluetoo… SOURCE http://sengledplus.com/products/integrated-led-light-bluetoo…   ", "source": "http://sengledplus.com/products/integrated-led-light-bluetooth-speakers-pewter", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://sengledplus.com/products/integrated-led-light-bluetooth-speakers-pewter", "https://itunes.apple.com/us/app/pulse-by-sengled/id840052462?mt=8", "http://www.tuaw.com/2014/10/15/pulse-by-sengled-ios-controllable-led-lights-with-speakers-by/#", "http://www.tuaw.com/tag/accessories/", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/iPad/", "http://www.tuaw.com/tag/iPhone/", "http://www.tuaw.com/tag/jbl/", "http://www.tuaw.com/tag/pulse+by+sengled/", "http://www.tuaw.com/tag/review/", "http://www.tuaw.com/tag/sengled/", "http://sengledplus.com/products/integrated-led-light-bluetooth-speakers-pewter"], "title": "Pulse by Sengled: iOS-controllable LED lights, with speakers by JBL", "tags": ["accessories", "features", "iPad", "iPhone", "jbl", "pulse by sengled", "review", "sengled"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/14/alpine-headphones-tout-immersive-experience-level-play-iphone/", "timestamp": "Oct 14th 2014 at 5:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [], "content": "Alpine has long been one of the big names associated with car audio systems, but the company has never really made a splash with connected personal audio until today. The company just launched Alpine Headphones that are available in Apple Stores around the world for a suggested retail price of US$299. So how did Alpine do with its first consumer headphone product? Read on for our review.    Alpine Alpine Headphones Specifications Specifications Weight: 12.6 ounces (357 grams) Impedence: 30 ± 20% Ohms at 1kHz Frequency response: 15Hz - 24,000Hz Sound pressure level: 107dB ± 3dB at 1kHz max Total harmonic distortion: \\<0.1% at 1mW/1kHz Colors: Apollo White, Onyx Black Includes: USB to micro-USB charging cable, iPhone audio cable with microphone, carry bag Design Design The Alpine Headphones are stunning. The white pair reviewed by TUAW has a very futuristic design, with a matte plastic band cushioned on the inside with a black matte foam. The earcups are diamond-shaped, with controls on the bottom of the left cup. Those controls are quite simple - there's just a power button. All the rest of the adjustments are made through the companion Level Play app (free). Level Play app   Alpine Headphones and Level Play app Alpine Headphones and Level Play app Alpine Headphones and Level Play app                  The app scans your music library, creating an \"intensity based\" playlist. What does that mean? The app looks at the beats per minute and sound wave frequency of each tune, then organizes the music library into one of three categories. Want a high-energy music experience? You swipe your finger up to the \"orange\" level. Looking to calm down and relax? Swipe your finger down to the \"blue\" level. It's a unique way at organizing music, that's for sure. I was a bit confused about the inclusion of a braided audio cable with the Alpine Headphones as I thought they were Bluetooth. You'll see my confusion when you look at the promo video below, where everybody is dancing around with the headphones on - without a cable in sight.   It turns out the Alpine Headphones are actually somewhat of a hybrid. The actual audio information goes through the cable from your iPhone to the headphones, but the custom settings you make in the app are transmitted to the headphones through Bluetooth LE. No misleading advertising here... Functionality Functionality   While the Level Play app provides a way to tweak your music library so that it sounds great, you're out of luck if you listen to other music sources. Sure, you can use the Alpine Headphones to listen to Spotify, iTunes Radio, or whatever else you like for streaming music, but you won't be able to adjust the equalization to your tastes as the music doesn't go through the Level Play app. Conclusion Conclusion If you're listening to your own music library on an iPhone, then you may want to consider the Alpine Headphones simply for the modern design as well as for the Level Play app and its ability to let you have a modicum of control over five separate frequency ranges. For those who either need a pair of headphones that can be useful with a number of devices, or who listen to streaming video, I'm not sure I can recommend these headphones. For $50 more, you could pick up a pair of top-rated Blue Microphones Mo-Fi amped headphones that sound great regardless of what device you're connected to or what music source you're using. Blue Microphones Mo-Fi amped headphones Rating: 3 stars out of 4 stars possible Rating: 3 stars out of 4 stars possible   VIEW TAGS VIEW TAGS         SOURCE: http://alpineheadphones.com/ SOURCE: http://alpineheadphones.com/ SOURCE http://alpineheadphones.com/   ", "source": "http://alpineheadphones.com/", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://www.alpine.com/", "http://www.alpineheadphones.com/", "https://itunes.apple.com/us/app/level-play/id867234235", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/3021055/#!slide=3021055", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/3021056/#!slide=3021056", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/3021057/#!slide=3021057", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/3021058/#!slide=3021058", "http://www.tuaw.com/photos/alpine-headphones-and-level-play-app/3021059/#!slide=3021059", "http://www.tuaw.com/2014/09/14/blue-microphones-breaks-the-headphone-mold-with-mo-fi/", "http://www.tuaw.com/2014/10/14/alpine-headphones-tout-immersive-experience-level-play-iphone/#", "http://www.tuaw.com/tag/accessories/", "http://www.tuaw.com/tag/alpine/", "http://www.tuaw.com/tag/alpine+headphones/", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/iPhone/", "http://www.tuaw.com/tag/review/", "http://alpineheadphones.com/"], "title": "Alpine Headphones tout \"immersive\" experience, Level Play iPhone app", "tags": ["accessories", "alpine", "alpine headphones", "features", "iPhone", "review"]},
{"author": "Kelly Hodgkins", "url": "http://www.tuaw.com/2014/10/09/today-in-the-app-store-the-best-free-apps-new-apps-and-app-u/", "timestamp": "Oct 9th 2014 at 5:30PM", "authorTwitter": "http://twitter.com/kellyhodgkins", "comments": [{"content": "I discovered a new interesting app. A kind of anonymous messaging photo sharing app: http://joinswipe.com/\n\nit makes a lot of fun to use", "timestamp": "2014-10-11T17:14:07.000Z", "author": "faridroushdy"}, {"content": "WHY does TUAW always post these late in the day? I check in the morning and the deals are gone. Clone Camera Pro is back to full price. Way to go. Unless it's a bait and switch deal with the developer... :/", "timestamp": "2014-10-10T14:13:46.000Z", "author": "JLX"}, {"content": "A few I like are:\n\nwhatsapp (group messagig)\nhapn (photo stories with friends)", "timestamp": "2014-10-09T23:03:24.000Z", "author": "RobertEastwood"}], "content": "  Here are some of the best free apps, app updates and new apps that have landed in the App Store recently. All app prices are USD and subject to change. Some deals may expire quickly, so grab them while you can. Apps Now Free Weather Dial - A Simpler, More Beautiful Weather App [iPhone; Now free, down from $1.99] .Weather Dial lets you spend more time enjoying the weather...then watching it. Weather Dial - A Simpler, More Beautiful Weather App [iPhone; Now free, down from $1.99] Weather Dial - A Simpler, More Beautiful Weather App Who Uses My WiFi? (WUMW) Protect your network from intruders [iPhone; Now free, down from $0.99] Who Uses My WiFi shows you exactly who is connected to your network and helps you create a safe password if you need to. Who Uses My WiFi? (WUMW) Protect your network from intruders [iPhone; Now free, down from $0.99] Who Uses My WiFi? (WUMW) Protect your network from intruders Clone Camera Pro for iPad [iPad; Now free, down from $1.99] Clone Camera helps you create flawless clone photos! Clone Camera Pro for iPad [iPad; Now free, down from $1.99] Clone Camera Pro for iPad Clone Camera Pro [iPhone; Now free, down from $1.99] Clone Camera helps you create flawless clone photos! Clone Camera Pro [iPhone; Now free, down from $1.99] Clone Camera Pro Media Player HD PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv [iPad; Now free, down from $1.99] edia Player PRO can play AVI, XVID, MPG, MKV, WMV, RMVB, DIVX, RM, AAC, WMA, DAT, VOB, FLV, etc. Media Player HD PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv [iPad; Now free, down from $1.99] Media Player HD PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv Media Player PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv [iPhone; Now free, down from $1.99] edia Player PRO can play AVI, XVID, MPG, MKV, WMV, RMVB, DIVX, RM, AAC, WMA, DAT, VOB, FLV, etc. Media Player PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv [iPhone; Now free, down from $1.99] Media Player PRO - Play Xvid, Mkv, Avi, Mpg, Rmvb, Wmv SoundTube Pro - Free Music Download & Mp3 Downloader for SoundCloud® [iOS Universal; Now free, down from $2.99] Search and download your favourite tracks from SoundCloud®. SoundTube Pro - Free Music Download & Mp3 Downloader for SoundCloud® [iOS Universal; Now free, down from $2.99] SoundTube Pro - Free Music Download & Mp3 Downloader for SoundCloud® New and Notable Apps Reckless Racing 3 [iOS Universal; $4.99] Reckless Racing is back with dirtier racetracks, more epic power slides, eye-popping graphics and the largest selection of cars and trucks to date. Reckless Racing 3 [iOS Universal; $4.99] Reckless Racing 3 Reflect+ [iOS Universal; $1.99] Reflect is a fun and simple way to add reflections and create beautiful photos. Reflect+ [iOS Universal; $1.99] Reflect+ Tail Drift [iOS Universal; $0.99] Jump into the pilot seat and take to the skies in this 360 degree arcade racer. Tail Drift [iOS Universal; $0.99] Tail Drift Cycloramic for iPhone 6 [iOS Universal; $1.99] Cycloramic Revolutionizes the way you take panoramic photos and videos! Handsfree! Cycloramic for iPhone 6 [iOS Universal; $1.99] Cycloramic for iPhone 6 Updates you don't want to miss Gmail - email from Google [iOS Universal; Free] The official Gmail app for your iPhone or iPad. Version 3.1415926 brings the following changes: Gmail - email from Google [iOS Universal; Free] Gmail - email from Google Support for iPhone 6 and iPhone 6 Plus Support for iPhone 6 and iPhone 6 Plus PicPlayPost [iOS Universal; Free] Use PicPlayPost® to create captivating stories with your photos, videos, GIFs and music. Version 5.0.4 brings the following changes: PicPlayPost [iOS Universal; Free] PicPlayPost Fixed issue importing videos on iPhone 4S, iPod Touch 5, iPad 2, and iPad Mini running iOS 8. #PicPlayPost now supports slideshows! (Requires iOS7 or higher) Select photos and/or GIFs to create up to 6 slide shows per project! Also introducing a special feature called the #PicPlayPostShow. Select a frame, build a slide show and experience a whole NEW kind of slide show. Further customize your images & videos with 20 new filters Flipboard: Your Social News Magazine [iOS Universal; Free] Flipboard is your personal magazine. Version 2.3.9 brings the following changes: Flipboard: Your Social News Magazine [iOS Universal; Free] Flipboard: Your Social News Magazine Improved stability on devices with iOS 8. Now displays in iPhone 6 & 6 Plus screen resolutions. Plus all the great features from 2.3.8: Right on time for iOS 8, it's now more convenient to collect what you love into Flipboard magazines across Apple's ecosystem. Collect articles and your own photos into magazines without opening the app: tap the share icon in Safari, Photos, or other compatible apps and select Flipboard. VIEW TAGS VIEW TAGS      SOURCE: http://www.tuaw.com/tag/App+Store/ SOURCE: http://www.tuaw.com/tag/App+Store/ SOURCE http://www.tuaw.com/tag/App+Store/   ", "source": "http://www.tuaw.com/tag/App+Store/", "authorUrl": "http://www.tuaw.com/editor/kelly-hodgkins/", "urlsInContent": ["https://itunes.apple.com/us/app/weather-dial-simpler-more/id536445532?mt=8", "https://itunes.apple.com/us/app/who-uses-my-wifi-wumw-protect/id869118704?mt=8", "https://itunes.apple.com/us/app/clone-camera-pro-for-ipad/id590380956?mt=8", "https://itunes.apple.com/us/app/clone-camera-pro/id557861125?mt=8", "https://itunes.apple.com/us/app/media-player-hd-pro-play-xvid/id578585836?mt=8", "https://itunes.apple.com/us/app/media-player-pro-play-xvid/id545166457?mt=8", "https://itunes.apple.com/us/app/soundtube-pro-free-music-download/id893530631?mt=8", "https://itunes.apple.com/us/app/reckless-racing-3/id882453590?mt=8", "https://itunes.apple.com/us/app/reflect+/id898143628?mt=8", "https://itunes.apple.com/us/app/tail-drift/id779076618?mt=8", "https://itunes.apple.com/us/app/cycloramic-for-iphone-6-not/id922304974?mt=8", "https://itunes.apple.com/us/app/gmail-email-from-google/id422689480?mt=8", "https://itunes.apple.com/us/app/picplaypost/id498127541?mt=8", "https://itunes.apple.com/us/app/flipboard-your-social-news/id358801284?mt=8", "http://www.tuaw.com/2014/10/09/today-in-the-app-store-the-best-free-apps-new-apps-and-app-u/#", "http://www.tuaw.com/tag/App+Store/", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/OS+X/", "http://www.tuaw.com/tag/App+Store/"], "title": "Today in the App Store -- the best free apps, new apps and app updates", "tags": ["App Store", "iOS", "OS X"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/14/avid-watch-sports-smartwatch-launches-on-kickstarter-a-first-lo/", "timestamp": "Oct 14th 2014 at 6:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [], "content": "Fitness wearables are the hot thing now, with a surprising number of new entrants rushing into the world where only Fitbit used to tread. Today, Vancouver-based AvidSport launched a Kickstarter campaign to get a new sports smartwatch called Avid Watch into production and in stores by April of 2015.   AvidSport Avid Watch What's different about Avid Watch? A lot of things. Sure, the watch itself has connectivity to your iPhone and there's an app for tracking your activity and changing settings -- many sports smartwatches have that capability. But the Avid Watch has built-in functions not only for running and walking, but cycling and golf as well. To enable tracking of your rides, runs, or golf rounds, Avid Watch comes with a separate wrist-borne device -- Avid Track -- so that you don't need to have your iPhone with you for GPS capabilities. With that short explanation out of the way, let's talk a bit about the pre-production device that I was able to test recently. Design Design The Avid Watch follows the tried and true design meme that seems to follow most smartwatches: it's a boxy little device, equipped out of the box with a flexible hypoallergenic silicone band. The band is about an inch wide and very comfortable on extended wear, and if you wish to, you can replace it with any other band you desire. The case of the watch is made of anodized aluminum, and there's a very useful display for telling you everything you'll need to know. That case is 1.48 inches wide at its widest point, and 1.67 inches high. It's about .48 inches thick.   There are four buttons on the device - one on the top left side, three others spaced equally on the right side. While the left button is used to power the watch on and off, the buttons on the right are used to navigate the user interface. This makes it much easier to move through the various screens -- that was one of the major problems I had with Wellograph. Wellograph Like Wellograph, the Avid Watch uses a monochrome display with a backlight that can be turned on with a push of the power button. The display is 1.26 inches diagonal, with 144 x 168 pixels resolution. The Avid Watch has a number of watch displays that you can choose from, and the watch is automatically set to your local time upon syncing it to your iPhone for the first time. The device also displays local weather by showing an icon (sun, cloud, etc...) and the temperature. I found the Avid Watch display to be much more readable under a variety of lighting conditions than the Wellograph.   Avid Watch, Avid Track and RW700 app Avid Watch, Avid Track and RW700 app Avid Watch, Avid Track and RW700 app                  Unlike the Avid Watch, the Avid Track has no display and features a bright silicone band (yellow on my test device) and case with a black top. There's one button on the device that's used to pair it with your iPhone or Avid Watch, and an LED to indicate status (red for charging, blue for on/pairing). Both devices come with magnetic charging cables; the one for the watch is more like a dock, while the other simply latches to the back of the Avid Track. Let it be known that I am not a fan of magnetic charging cables ever since I had one latch onto another plugged-in USB cable, short out, and melt the cable... Let's hear it for inductive chargers! I am not a fan of magnetic charging cables The battery is designed to last up to 41 days between charges if you're just using the Avid Watch as a timepiece. Use Bluetooth, and the battery life goes down to 4 days. In GPS mode (which I don't understand as the Watch doesn't have built-in GPS but uses Bluetooth to communicate with the iPhone or Avid Track), you'll get about 14 hours of life. Function Function Due to the short amount of time I had to test the device prior to writing this review, I can't say that I was able to give it the full workout. However, I was able to test its functionality as a step tracker and smartwatch, and even try the Avid Watch / Avid Track combo. I tested a pre-production unit, and on occasion it acted like one. For example, when I first tried to get the Avid Watch and Avid Track to pair via Bluetooth, they wouldn't connect. Other times, they synced almost immediately. My guess is that the first sync attempts were occurring inside my office where the GPS signal was nonexistent, and that was keeping things from working properly. As a smartwatch, the Avid Watch works as a wrist-mounted display to provide notifications. You'll see who calls are coming from, notifications of new mail or text messages, what's happening on your favorite social networks, reminders, and what's coming up on your calendar. One thing I could not figure out how to do is call up a history of the notifications for review. You can also do some rather fun things with the watch, like control music on your iPhone or use it as a remote shutter release for the camera on your phone. There's even a way to get your iPhone to buzz or chime if you've misplaced it, simply by pressing a button on the watch. With the accompanying RW700 app (free) on your iPhone, you're able to get a view of all of the workouts you've gone through, change settings, and send your tracked items to the Avidsport cloud. RW700 app I was particularly fascinated with the golf function. According to the Avid Sports team, the watch comes with about 3,000 golf course layouts pre-loaded. For a specific hole, the Avid Watch calculates distance to the front, center and back of the green -- no more guessing. You can also use the device as an electronic scorecard by capturing stokes and penalties, then push the information to the RW700 app and on to the Avid Sport dashboard for further analysis. Upon linking the Avid Watch and Avid Track, then giving the devices a minute to think, I was greeted with a very accurate and complete list of local golf courses. Had I been on one of the courses -- and on the first hole -- I would have seen the distances to the green as well. What's the watch missing? As far as I can tell, there's no way for it to sense and track your heart rate (you can link a Bluetooth heart rate monitor to it, but that's yet another device). Although it can act as a notification device for a number of apps, it doesn't seem to have a developer API so that third-party developers can add new notifications -- perhaps that's done by the AvidSport team. There's also no sleep tracking capability, something that is popular with those who track their health religiously. To be honest, I'm confused about the entire idea of having a second \"watch\" (the Avid Track) for the GPS function. That idea is based on runners, cyclists, and golfers not wanting to carry their smartphones with them, yet this is something that most fitness fanatics have no problems doing since they want to listen to music or even take photos while out and about. By adding a second wrist device, the team is adding unneeded complexity to the design as the Watch has to be able to pair not only with the iPhone, but with another device as well. Although the Avid Watch/Avid Track combo is reasonably priced at CAD$189, not having the Avid Track would drop the price of the Watch alone into a realm that would be even more affordable. The Avid team does point out that you can still run without wearing Avid Track or pairing the device with a smartphone -- you just won't get a route record. Conclusion Conclusion Since this is a Kickstarter campaign and there is obviously some work left to be done prior to the actual release of the product, I'm not going to provide one of our \"star ratings\" at this time. In summary, things I like about the Avid Watch include the easy-to-navigate user interface, the reasonable price point, the display clarity (especially in bright sunlight), and the multi-sport orientation. The main thing I'm not fond is the idea of wearing a second wristband to supply GPS, although that's a personal preference for me -- as we say in the blogging business, your mileage may vary if you don't always carry your smartphone with you. I noted during my recent review of the Wallograph that I wondered how anyone could even think about developing a smartwatch at this time when the twin gorillas in the room - Apple Watch and Android Wear -- are getting ready to unleash much more capable devices. Well, the Avid Watch is less expensive, and for a number of athletes it may be all they really need. is As with all crowdfunding projects, the public will get to \"vote\" for the Avid Watch with their wallets. The team has a goal of raising CDN$150,000 in the next 30 days, and I wish them the best of luck - they're obviously talented, but just need a bit more time and money to polish up the rough edges. Especially if you're a golfer, the Avid Watch has a lot to offer. VIEW TAGS VIEW TAGS              SOURCE: https://www.kickstarter.com/projects/1696967671/avid-watch-m… SOURCE: https://www.kickstarter.com/projects/1696967671/avid-watch-m… SOURCE https://www.kickstarter.com/projects/1696967671/avid-watch-m…   ", "source": "https://www.kickstarter.com/projects/1696967671/avid-watch-multi-sport-smart-watch-with-activity-t?ref=nav_search", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://avidsport.net/", "https://www.kickstarter.com/projects/1696967671/avid-watch-multi-sport-smart-watch-with-activity-t?ref=nav_search", "http://www.tuaw.com/2014/10/03/wellograph-watch-activity-tracking-with-style-and-sapphire/", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/3021439/#!slide=3021439", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/3021440/#!slide=3021440", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/3021441/#!slide=3021441", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/3021442/#!slide=3021442", "http://www.tuaw.com/photos/avid-watch-avid-track-and-rw700-app/3021443/#!slide=3021443", "http://www.tuaw.com/2014/07/31/runtastic-orbit-the-new-activity-tracker-on-the-block/", "https://itunes.apple.com/us/app/rw700/id875687639?mt=8", "http://www.tuaw.com/2014/10/14/avid-watch-sports-smartwatch-launches-on-kickstarter-a-first-lo/#", "http://www.tuaw.com/tag/accessories/", "http://www.tuaw.com/tag/activity+tracker/", "http://www.tuaw.com/tag/avid+sports/", "http://www.tuaw.com/tag/avid+track/", "http://www.tuaw.com/tag/avid+watch/", "http://www.tuaw.com/tag/crowdfunding/", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/golf/", "http://www.tuaw.com/tag/kickstarter/", "http://www.tuaw.com/tag/review/", "http://www.tuaw.com/tag/smartwatch/", "https://www.kickstarter.com/projects/1696967671/avid-watch-multi-sport-smart-watch-with-activity-t?ref=nav_search"], "title": "Avid Watch sports smartwatch launches on Kickstarter: A first look", "tags": ["accessories", "activity tracker", "avid sports", "avid track", "avid watch", "crowdfunding", "features", "golf", "kickstarter", "review", "smartwatch"]},
{"author": "Kelly Hodgkins", "url": "http://www.tuaw.com/2014/07/29/spotify-update-adds-equalizer-refreshed-artist-page-and-more/", "timestamp": "Jul 29th 2014 at 9:34AM", "authorTwitter": "http://twitter.com/kellyhodgkins", "comments": [{"content": "Deezer is a much better service but, although they've had equalixer for a while, their app is ugly.\nSpotify need to do something about their exorbitant fees....", "timestamp": "2014-08-01T12:59:01.000Z", "author": "cgs101"}, {"content": "I used to love Spotify, but the Your Music section became my main means of organising my music. However, since they still (months and months later) haven't updated their iPad app to reflect this, I have now cancelled Spotify and am with Deezer. I'm actually happy I made the switch, as well as a consistent interface across platforms they seem to have a better music selection and is on sale at the moment for half price.", "timestamp": "2014-07-30T06:57:33.000Z", "author": "gshearman"}], "content": "  Hot on the heels of yesterday's Beats Music refresh, Spotify today also updated its iOS app adding several new features and UI changes to the music streaming app. The most notable change to Spotify Music is the addition of a new equalizer that allows you to tweak the levels to get the sound that is perfect for you. Beats Music refresh Spotify  Besides an equalizer, Spotify also updated the Artist page on the iPad to include information on the artist's latest releases and associated merchandise. The app's designers also moved the Discover feature on the iPhone to the Browse section of the app. The full change log for version 1.5.0 is as follows: New: Want an equalizer? OK, it's waiting for you in Settings. Go play. New: Looking for Discover? You'll now find it inside Browse. (iPhone) New: We've redesigned the Artist page for iPad, now with latest release and merchandise. Fictitious: This app will swap any sticker for Messi. Spotify is available for free from the iOS App Store. It is a universal app and requires iOS 6 or later. Spotify VIEW TAGS VIEW TAGS       SOURCE: https://itunes.apple.com/us/app/spotify-music/id324684580?mt… SOURCE: https://itunes.apple.com/us/app/spotify-music/id324684580?mt… SOURCE https://itunes.apple.com/us/app/spotify-music/id324684580?mt…   ", "source": "https://itunes.apple.com/us/app/spotify-music/id324684580?mt=8", "authorUrl": "http://www.tuaw.com/editor/kelly-hodgkins/", "urlsInContent": ["https://itunes.apple.com/us/app/spotify-music/id324684580?mt=8", "https://itunes.apple.com/us/app/spotify-music/id324684580?mt=8", "https://itunes.apple.com/us/app/spotify-music/id324684580?mt=8", "http://www.tuaw.com/2014/07/29/spotify-update-adds-equalizer-refreshed-artist-page-and-more/#", "http://www.tuaw.com/tag/newsletter/", "http://www.tuaw.com/tag/Software+Update/", "http://www.tuaw.com/tag/SoftwareUpdate/", "http://www.tuaw.com/tag/Spotify/", "https://itunes.apple.com/us/app/spotify-music/id324684580?mt=8"], "title": "Spotify update adds equalizer, refreshed Artist page and more", "tags": ["newsletter", "Software Update", "SoftwareUpdate", "Spotify"]},
{"author": "Kelly Hodgkins", "url": "http://www.tuaw.com/2014/07/31/ember-for-mac-gains-hugely-requested-screen-recording-feature/", "timestamp": "Jul 31st 2014 at 10:30AM", "authorTwitter": "http://twitter.com/kellyhodgkins", "comments": [{"content": "You can record your screen for free by just using the QuickTime Player which is already on any Mac.", "timestamp": "2014-07-31T16:35:40.000Z", "author": "igepard"}, {"content": "@igepard To expand on this. Open QuickTime > File (Menu Bar) > New Screen Recording", "timestamp": "2014-07-31T23:54:17.000Z", "author": "JohnCeniza"}, {"content": "@JohnCeniza @igepard", "timestamp": "2014-08-06T21:52:58.000Z", "author": "Philscbx1"}, {"content": "@JohnCeniza @igepard\nI must have forgot this option - w/ QT.\nThen ended up using IShowU HD, It has it +,- at times.", "timestamp": "2014-08-06T21:58:13.000Z", "author": "Philscbx1"}, {"content": "@igepard My thoughts exactly.  Not a post-worthy feature.", "timestamp": "2014-08-07T15:09:03.000Z", "author": "a1a23696"}], "content": "  Popular web clipper and digital scrapbooking app Ember was updated today with a killer new feature -- the ability to make a video recording of your screen. No longer limited by only static images, Ember now allows you to capture your screen as you demo webpages, click through a presentation or showcase an app. Ember The new scree recording feature in Ember version 1.8 allows you to capture more than just a static screen shot. You can now select a small section of your desktop or the entire screen (command-a in screen recording mode) and record in 60fps video. The recordings are saved in the Ember app and are treated just like any other Ember capture The video also can be synced between your iOS and OS X devices, shared with your friends or exported as a .MOV file that can be stored on your Mac The latest version of Ember with screen recording is available now in the Mac App Store for US$49.99. Ember VIEW TAGS VIEW TAGS            SOURCE: http://realmacsoftware.com/ember SOURCE: http://realmacsoftware.com/ember SOURCE http://realmacsoftware.com/ember   ", "source": "http://realmacsoftware.com/ember", "authorUrl": "http://www.tuaw.com/editor/kelly-hodgkins/", "urlsInContent": ["http://realmacsoftware.com/ember", "https://itunes.apple.com/us/app/ember-screenshot-annotate/id402456742?mt=12", "http://www.tuaw.com/2014/07/31/ember-for-mac-gains-hugely-requested-screen-recording-feature/#", "http://www.tuaw.com/tag/Ember/", "http://www.tuaw.com/tag/Mac/", "http://www.tuaw.com/tag/newsletter/", "http://www.tuaw.com/tag/OS+X/", "http://www.tuaw.com/tag/realmac+software/", "http://www.tuaw.com/tag/RealmacSoftware/", "http://www.tuaw.com/tag/software/", "http://www.tuaw.com/tag/Software+Update/", "http://www.tuaw.com/tag/SoftwareUpdate/", "http://realmacsoftware.com/ember"], "title": "Ember for Mac gains 'hugely-requested' screen recording feature", "tags": ["Ember", "Mac", "newsletter", "OS X", "realmac software", "RealmacSoftware", "software", "Software Update", "SoftwareUpdate"]},
{"author": "Kelly Hodgkins", "url": "http://www.tuaw.com/2014/08/06/yahoo-mail-improves-email-inbox-searching-with-new-filtering-opt/", "timestamp": "Aug 6th 2014 at 1:00PM", "authorTwitter": "http://twitter.com/kellyhodgkins", "comments": [], "content": "  Yahoo today pushed out an update to its iOS Mail app, adding an improved search experience to the app's lineup of features. This latest update, available now in the App Store, brings the email client up to version 3.2.0. its iOS Mail app The new search option allows users to search for a contact's name and filter the results by email or attachments such as photos or files. This would allow a user to quickly find an email in their inbox that contains an important screenshot or document. Other changes include standard performance improvements and bug fixes. What's New in Version 3.2.0 What's New in Version 3.2.0 - We're excited to introduce you to our new and improved search experience. Now, when you search for a person's name, you can easily filter the results by emails, photos, or files. We hope you love it as much as we do! Please drop us a note at aerogram-feedback@yahoo-inc.com with your thoughts or suggestions. - Performance improvements - Bug fixes Yahoo Mail is available for free from the iOS App Store. Yahoo Mail VIEW TAGS VIEW TAGS         SOURCE: https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id… SOURCE: https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id… SOURCE https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id…   ", "source": "https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id577586159?mt=8", "authorUrl": "http://www.tuaw.com/editor/kelly-hodgkins/", "urlsInContent": ["https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id577586159?mt=8", "https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id577586159?mt=8", "http://www.tuaw.com/2014/08/06/yahoo-mail-improves-email-inbox-searching-with-new-filtering-opt/#", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/newsletter/", "http://www.tuaw.com/tag/Software+Update/", "http://www.tuaw.com/tag/SoftwareUpdate/", "http://www.tuaw.com/tag/Yahoo/", "http://www.tuaw.com/tag/Yahoo+Mail/", "https://itunes.apple.com/us/app/yahoo-mail-free-email-app/id577586159?mt=8"], "title": "Yahoo Mail improves email inbox searching with new filtering options", "tags": ["iOS", "newsletter", "Software Update", "SoftwareUpdate", "Yahoo", "Yahoo Mail"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/09/24/ios-8-0-1-update-now-available/", "timestamp": "Sep 24th 2014 at 1:15PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [{"content": "Our two iPhone 5's are using IOS 8.0.2.  We were not aware that there was a later update.  ", "timestamp": "2014-10-08T12:47:13.000Z", "author": "IvanEdelman"}, {"content": "I have just checked with my iPhone and it said iOS 8.0.0 is the latest version. Maybe Apple pulled the update ?", "timestamp": "2014-09-25T00:48:06.000Z", "author": "ulyssesric"}, {"content": "Here's a fix for anyone on 8.0.1 that's now broken..\n\n http://lifehacker.com/fix-ios-8-0-1-upgrade-issues-by-disabling-icloud-and-re-1638744410", "timestamp": "2014-09-24T20:37:14.000Z", "author": "LaneJasper"}, {"content": "the morons at apple are clueless.", "timestamp": "2014-09-24T18:36:26.000Z", "author": "creelington"}, {"content": "mines dead too.....apple didn't know it was happening till I called them, lol.", "timestamp": "2014-09-24T18:35:46.000Z", "author": "creelington"}, {"content": "Apple. It just works!", "timestamp": "2014-09-24T18:22:08.000Z", "author": "CannabisTVorg"}, {"content": "IT'S A TRAP! LOL", "timestamp": "2014-09-24T18:08:03.000Z", "author": "minime"}, {"content": "Somebody is going to be fired! All these bricked phones will show up at the apple stores.", "timestamp": "2014-09-24T18:06:28.000Z", "author": "mdowling1960"}, {"content": "@mdowling1960 Actually Timmy should resign,, wait 3 -6 months when the real story of how durable the new phones are comes out... he will deny any responsibility and his followers will defend him .. but If he is not damned by complicity then he is damned by incompetence... ", "timestamp": "2014-10-15T12:55:07.000Z", "author": "broblk"}, {"content": "Same. Bricked.", "timestamp": "2014-09-24T17:38:10.000Z", "author": "LouieCampagna"}, {"content": "Same here. No cell service or Touch ID. Tried hard reset and also reset my my network settings. No fix yet.", "timestamp": "2014-09-24T17:34:59.000Z", "author": "Hart4God"}, {"content": "I have the same problem as the other commenter: no cell service, no TouchID.", "timestamp": "2014-09-24T17:31:11.000Z", "author": "MatthewFitzsimmons"}, {"content": "@MatthewFitzsimmons well.. so what .. now you have a $1000 iPod /s", "timestamp": "2014-10-15T12:56:01.000Z", "author": "broblk"}, {"content": "DO NOT UPDATE!!!!! This update breaks the cell service (no service on the top right of the screen) and breaks the Touch ID too!  DO NOT UPDATE!!!!!!!", "timestamp": "2014-09-24T17:22:51.000Z", "author": "LazaroFilm"}], "content": "  Update: In the meantime, do not update!       http://support.apple.com/kb/HT1222   VIEW TAGS VIEW TAGS       SOURCE: http://support.apple.com/kb/HT1222 SOURCE: http://support.apple.com/kb/HT1222 SOURCE http://support.apple.com/kb/HT1222   ", "source": "http://support.apple.com/kb/HT1222", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://support.apple.com/kb/HT1222", "http://www.tuaw.com/2014/09/24/ios-8-0-1-update-now-available/#", "http://www.tuaw.com/tag/HealthKit/", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/iOS+8.0.1/", "http://www.tuaw.com/tag/software+update/", "http://support.apple.com/kb/HT1222"], "title": "iOS 8.0.1 update now available (Updated -- Don't update!)", "tags": ["HealthKit", "iOS", "iOS 8.0.1", "software update"]},
{"author": "John-Michael Bond", "url": "http://www.tuaw.com/2014/10/15/youtube-for-ios-gets-updated-with-full-support-for-iphone-6-and/", "timestamp": "Oct 15th 2014 at 3:30PM", "authorTwitter": "http://twitter.com/BondJohnBond", "comments": [{"content": "Can anyone confirm if it has 1080P streaming? Android version now doesn't on MOST devices and it used to....Google keep screwing with it. And save the iOS VS Android opinions, I use both thank you.", "timestamp": "2014-10-15T22:13:35.000Z", "author": "LaneJasper"}], "content": "   updated   Now updated for iPhone 6. Includes bug fixes to... Prevent the status bar from overlapping the UI Address keyboard orientation issues Make scrubbing more responsive Show all playlists when adding videos iOS here VIEW TAGS VIEW TAGS      SOURCE: https://itunes.apple.com/us/app/youtube/id544007664?mt=8 SOURCE: https://itunes.apple.com/us/app/youtube/id544007664?mt=8 SOURCE https://itunes.apple.com/us/app/youtube/id544007664?mt=8   ", "source": "https://itunes.apple.com/us/app/youtube/id544007664?mt=8", "authorUrl": "http://www.tuaw.com/editor/john-michael-bond/", "urlsInContent": ["https://itunes.apple.com/us/app/youtube/id544007664?mt=8", "https://itunes.apple.com/us/app/youtube/id544007664?mt=8", "http://www.tuaw.com/2014/10/15/youtube-for-ios-gets-updated-with-full-support-for-iphone-6-and/#", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/update/", "http://www.tuaw.com/tag/youtube/", "https://itunes.apple.com/us/app/youtube/id544007664?mt=8"], "title": "YouTube for iOS gets updated with full support for iPhone 6 and 6 Plus", "tags": ["iOS", "update", "youtube"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/09/17/psa-ios-8-is-going-to-make-your-iphone-4s-a-good-bit-slower/?cps=gravity&ncid=rss_truncated", "timestamp": "Sep 17th 2014 at 12:45PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "It's common for hardware to perform slower with more powerful software.  iOS 9 won't run on 4S at all.", "timestamp": "2014-10-05T22:42:45.000Z", "author": "LefD Entertainment"}, {"content": "I have a 4s and some of my apps are actually faster now with iOS8", "timestamp": "2014-09-18T16:51:25.000Z", "author": "LanceBowers"}, {"content": "@LanceBowers Should I go ahead with updating my iphone 4s. I have downloaded the software but not installed....", "timestamp": "2014-09-19T05:20:57.000Z", "author": "HappySingh"}, {"content": "You guys need to get a life.These complaints are trivial.it's the end of the world,I have to charge my iPhone twice a day:(>", "timestamp": "2014-09-18T14:36:19.000Z", "author": "SusanTimmer"}, {"content": "@SusanTimmer Reporting apple news is their job. they need to get a life for reporting apple news?", "timestamp": "2014-09-18T17:21:20.000Z", "author": "HughesNet"}, {"content": "@SusanTimmer Yours is not the life I want with my phone.", "timestamp": "2014-10-06T14:40:31.000Z", "author": "Andrea C."}, {"content": "@Andrea C. @SusanTimmer What? It is the end of the world,messages now take 1.83 second to load,before the update it was 1.73 seconds.\nGet a life!", "timestamp": "2014-10-08T16:57:49.000Z", "author": "SusanTimmer"}, {"content": "@SusanTimmer @Andrea C. It's not only the messages, my apps close, battery life is less than half and phone turns off. I have a good life, thanks!", "timestamp": "2014-10-08T18:16:12.000Z", "author": "Andrea C."}, {"content": "I've actually had the opposite happen to me . . . app start-up might be a shade slower, but I know my battery life was MUCH noticeably longer last night after upgrading. I was in iMessage, using the new keyboard tool, back and forth with two people, for over an hour straight - which prior to the upgrade would have taken at least 20% or more off of my phone, and it took maybe 8%.  Siri and iMessage were also much faster.  So, I'll take the little bump I can have while I wait for my new phone to come tomorrow.", "timestamp": "2014-09-18T13:17:34.000Z", "author": "daisymae0"}, {"content": "And pre ios 8 You weren't experiencing the inevitable iPhone battery depletion? The '5' is now 24 months old. Inevitably for me and each phone I've had; Android or iOS, after 14-18 months the 'health' of the battery, it's endure © and ability to hold charge diminishes with time. I've got the 5s & Note 3. My wife the 5. I'm seeing no depletion on the 5s, maybe 20% loss in the 5, the Note 3 ...also a year old has me bewildered. Perhaps I received a bad battery initially and have since bought a pair of replacements. One OEM the other a larger, third party battery. Bought my wife a Mophie case and all is well in the world.\nJust a bit curious though on yours ...JUST using iMessage (& keyboard utility ...did you change back a few times? DL another keyboard, change em out from stock, compare between the two, three or how many you've tried? I'm curious as I said, wig my bride's five. May be time to sell it as she's going to get the 6+, while passing my down to my son.", "timestamp": "2014-09-18T16:36:40.000Z", "author": "anchoragedj"}, {"content": "For the past year, my routine with the iPhone 5 has been: at the gym at 5:20 am; use iPhone for continuous Bluetooth music streaming and an exercise-recording app.  Then at 6:30 am, a drive-home while talking on the phone for 15 minutes.  After breakfast, my iPhone 5 typically had 85% battery remaining (indicated) at 7:00 am. \n\nThis morning (after updating to iOS 8 yesterday), the same routine, my iPhone 5 indicated... 51% !!!\n\nWTH? At this rate of depletion, I'll need to charge my iPhone three times per day!  Eeeeeee.\n\nOtherwise, iOS 8 is working pretty good.  No noticeable slowness.  One weird thing:  when I was on the phone speaking with a person, a pre-set alarm went off -- and I got a gray screen that didn't allow me to do anything.  I had to disconnect the phone call and then was returned to a screen to \"tap' to end the alarm.", "timestamp": "2014-09-18T13:07:54.000Z", "author": "VKMTUAW"}, {"content": "Way to totally misread the Ars Technica story. They are recommending not upgrading due to screen space issues. They are actually saying the its not a huge amount slower, unlike the iPhone 4 and iOS 7. But hey, got to get those clicks haven't you.", "timestamp": "2014-09-17T19:34:48.000Z", "author": "ianc14"}, {"content": "Wow that is not bad, I thought it would be a lot slower. for example iOS 7 slowed the boot time on the iPhone 4 from 38.72 seconds to 4.2 weeks", "timestamp": "2014-09-17T17:09:44.000Z", "author": "Grem"}, {"content": "OMG! OMG! 1.83 instead of 1.73 seconds! OMG!  A good bit? less than a fraction of a second in most cases. Even then... milage may vary depending..\n\nMy 4s in REAL world use I can't tell the difference. Especially when I turn off flashy stuff. it's an older device.. The trade off is by far worth it for extensibility, keyboards, etc.\n\ngreat click bait though.. ", "timestamp": "2014-09-17T16:51:46.000Z", "author": "adrayven"}, {"content": "@adrayven Any device more than 2 years out should be wary of updating.  It happens every single time.  I was a victim of having my iPhone 3G turn to a complete piece of crap back in the day.\nThe numbers may be small, but when it's a device that you use constantly throughout the day, switching back and forth between apps, that fraction of a second adds up and becomes annoying.", "timestamp": "2014-09-17T17:04:03.000Z", "author": "Bieber"}, {"content": "Especially if you're still paying for the phone on a plan! Month to month or like a track phone. But if you're contracted with a family or more than one device plan, you're STILL paying the silly 'built in' subsidy for the phone itself! Maybe $30/$35 in the good ol' USA anyway. After 24 months, once you've 'paid for your phone' ...& you're happy with your carrier, it's time for a new phone, contract, and sale of your older phone. Maybe you're in a part of the world with better oversight of the mobile industry. If so, not the case. If you're here, with Bieber ;)\nJ", "timestamp": "2014-09-18T16:42:49.000Z", "author": "anchoragedj"}], "content": "  When iOS 7 launched, those with an iPhone 4s took issue with the slower application launches and hampered battery life, and at least one of those issues is going to get even worse with an upgrade to iOS 8. Ars Technica put the stopwatch to an iPhone 4s running the gold master of iOS 8 (the version you'll be able to download today), and the numbers aren't pretty. Ars Technica put the stopwatch to an iPhone 4s   Almost everything tested is significantly slower with the new update, but the Calendar, Mail, and Safari apps are hit the hardest. The iPhone 4s also won't be getting the benefits of the Metal API -- the new graphics framework designed to enhance iOS game performance -- which is going to be a bummer for anyone who uses their phone for gaming. This kind of thing isn't new, and with every new release of iOS 8 the oldest supported device regularly experiences some performance issues. The iPhone 4s is three years old at this point, and while iOS 8 is still a good upgrade for the aging phone (it adds both third party keyboard support and widgets, after all), the price you pay for sticking with old hardware will always be dwindling performance. [Chart via Ars Technica] Ars Technica VIEW TAGS VIEW TAGS       SOURCE: http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-… SOURCE: http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-… SOURCE http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-…   ", "source": "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/", "http://www.tuaw.com/2014/09/17/psa-ios-8-is-going-to-make-your-iphone-4s-a-good-bit-slower/?cps=gravity&ncid=rss_truncated#", "http://www.tuaw.com/tag/ars+technica/", "http://www.tuaw.com/tag/ios/", "http://www.tuaw.com/tag/ios+8/", "http://www.tuaw.com/tag/iphone+4s/", "http://arstechnica.com/apple/2014/09/ios-8-on-the-iphone-4s-performance-isnt-the-only-problem/"], "title": "PSA: iOS 8 is going to make your iPhone 4s a good bit slower", "tags": ["ars technica", "ios", "ios 8", "iphone 4s"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/16/mac-grows-even-as-industry-slides/", "timestamp": "Oct 16th 2014 at 2:30PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [], "content": "  Mac VIEW TAGS VIEW TAGS      SOURCE: http://www.tuaw.com/tag/apple SOURCE: http://www.tuaw.com/tag/apple SOURCE http://www.tuaw.com/tag/apple   ", "source": "http://www.tuaw.com/tag/apple", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.tuaw.com/category/Mac/", "http://www.tuaw.com/2014/10/16/mac-grows-even-as-industry-slides/#", "http://www.tuaw.com/tag/mac/", "http://www.tuaw.com/tag/mac+growth/", "http://www.tuaw.com/tag/pc/", "http://www.tuaw.com/tag/apple"], "title": "Mac grows even as industry slides", "tags": ["mac", "mac growth", "pc"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/10/apple-to-cull-bose-products-from-retail-stores/", "timestamp": "Oct 10th 2014 at 12:45PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "Just wandering who got more publicity out of this Boss or Beats, All pictures I've seen have a picture of some player wearing Beats headphones.", "timestamp": "2014-10-10T20:45:57.000Z", "author": "GulliJohansen"}, {"content": "First of all they look like douchebags wearing ANY headphones before the game.\nSecond, Bose probably paid a lot of money to the NFL to be the exclusive provider just like Nike did for the equipment so I'm sure the players knew this. This is obviously a PR stunt that Kaeperdick knew very well.", "timestamp": "2014-10-10T19:41:02.000Z", "author": "nachorrin"}, {"content": "like seriously the NFL is fining players for wearing their preferred headphones.... That's like saying if you don't like what we like, u gotta pay up.  Nazi much?", "timestamp": "2014-10-10T17:56:42.000Z", "author": "AndrewVonPeltIII"}, {"content": "@AndrewVonPeltIII or 1984. Either/Or.", "timestamp": "2014-10-10T19:12:27.000Z", "author": "woody24"}, {"content": "@AndrewVonPeltIII No, the NFL is fining players for violating their employment agreement, which states that during any publicly visible league related activities (which includes being on the sidelines during a game, giving post-game interviews, etc.), they cannot use identifiable (by logos, etc.) products from competitors of sponsors that have paid the NFL a _lot_ of money for exclusive exposure.  The rules don't restrict them in their private lives, just during work time.  Most employers have rules restricting employees from doing  things during work hours that the employer considers harmful to the business - this is no different, and the players are being paid a boatload of money as part of their employment so I don't really feel sorry for them (they don't have to play in the NFL if it's that much of a problem to them).  Note that I'm not sure how much the bad publicity from flaps like Kaepernick's hurts, but I think studies show that the flaps blow over quickly and the sponsorships are worth a lot of money to both sides, so...", "timestamp": "2014-10-10T20:12:09.000Z", "author": "SteveAustin"}, {"content": "@SteveAustin @AndrewVonPeltIII But it's a blanket license agreement, that started after the season started. Or at least from what I understand. I understand  having only to wear or use a product. But I think it's ridiculous that the NFL agreed to this. Sure, money talks. But to force ALL players to wear one brand of headphone?\n\nIt'd be like Oakley saying that players can only wear their sunglasses and prescription eyewear.\n\nIf my place of employment wants to pay for that, then sure, I'll wear it. But if I already have a deal with another brand, I'd sure hope that'd trump a blanket license. \n\nBut I don't see why it just wasn't a sponsorship of the NFL. Like no other brands of headphones can advertise during a game. And if players are wearing other brands products, just don't show them. That's what they used to do. ", "timestamp": "2014-10-10T20:47:38.000Z", "author": "woody24"}, {"content": "@woody24 @SteveAustin @AndrewVonPeltIII Your private deal does not trump the employer's deal (at least in this case).  That is why players who endorse Adidas still have to wear Nikes during the game, and are fined if they cover up the Nike logo on their cleats.  The NFL doesn't forbid players from doing their own endorsement deals - they are just subordinate to the NFL's sponsorship/endorsement deal during NFL activities.\n\nThis _is_ a sponsorship of the NFL.  But the sponsors see a major part of the value they get (and pay for) being that only their product is seen on coaches, players, etc. during the game activities - it is basically a product placement deal, and the product placement value is lost if the competitor's product is there too.  Trying to \"just not show them\" doesn't work well if the competitor's product is being used by a player (like a QB) who will be (and the NFL wants to be) on camera a lot.", "timestamp": "2014-10-10T21:00:42.000Z", "author": "SteveAustin"}, {"content": "That's ridiculously stupid about the whole Bose NFL deal. I get that there's a deal for the uniforms, because every player has to wear the same thing. It's kinda how sports work. But to force people to only wear one brand of headphone for personal use, it's kinda dumb. \n\nWhat if I really really need music to help calm my nerves before a game, but the way Bose headphone fit, give my a headache?\n\nI suppose the same can be said for drink sponsors. But still, I find headphones one of those things that is just unnecessarily mandated. Hope Bose gave every single NFL player, every product from their line. Because you can't be a sponsor of all the players, and expect them to buy your product from you.", "timestamp": "2014-10-10T17:14:54.000Z", "author": "woody24"}, {"content": "@woody24  I'm torn. I get that they should have to use specific equipment during the game and 'on the companies time', but other than that you should be able to do what you want.", "timestamp": "2014-10-10T17:48:19.000Z", "author": "richard.j.ludwig"}, {"content": "@richard.j.ludwig @woody24 Right. Showing up from the bus, to leaving the game afterwards. No one wants to swap out headphones. \n\nNow, I can see the the team using the headsets to talk to spotters and stuff. But yeah, your own time, you should be able to wear what you want.\n\nWould be like GM saying you can only drive GM cars to and from the stadium. ", "timestamp": "2014-10-10T18:24:03.000Z", "author": "woody24"}, {"content": "@richard.j.ludwig @woody24 And they can, on their own time.  But from the time players show up for a game until they leave the stadium, and any time the are doing game/league related activities (like having an ESPN interview), they _are_ on \"company time\", not their own...", "timestamp": "2014-10-10T20:16:11.000Z", "author": "SteveAustin"}, {"content": "You may think it ridiculous but it is the contract they signed. Likely including clauses that such sponsorships can happen at any time in the season etc.\nAnd given he was in compsny time he has to play by said rules. If he was fined for being seen jogging in his own neighborhood that would be different", "timestamp": "2014-10-15T17:02:04.000Z", "author": "jayne r"}], "content": "  reports   first victim of the new policy VIEW TAGS VIEW TAGS        SOURCE: http://www.macrumors.com/2014/10/10/apple-bose-removal/ SOURCE: http://www.macrumors.com/2014/10/10/apple-bose-removal/ SOURCE http://www.macrumors.com/2014/10/10/apple-bose-removal/   ", "source": "http://www.macrumors.com/2014/10/10/apple-bose-removal/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.macrumors.com/2014/10/10/apple-bose-removal/", "http://www.tuaw.com/2014/10/09/niners-qb-colin-kaepernick-fined-10-000-for-wearing-beats-by-dr/", "http://www.tuaw.com/2014/10/10/apple-to-cull-bose-products-from-retail-stores/#", "http://www.tuaw.com/tag/apple+store/", "http://www.tuaw.com/tag/beats/", "http://www.tuaw.com/tag/bose/", "http://www.tuaw.com/tag/news/", "http://www.tuaw.com/tag/retail/", "http://www.macrumors.com/2014/10/10/apple-bose-removal/"], "title": "Apple to cull Bose products from retail stores", "tags": ["apple store", "beats", "bose", "news", "retail"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/10/i-played-this-top-selling-game-100-times-and-this-is-what-i-lea/", "timestamp": "Oct 10th 2014 at 3:00PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [], "content": "  Soccer Physics   US$1.99 price tag                 VIEW TAGS VIEW TAGS        SOURCE: https://itunes.apple.com/us/app/soccer-physics/id898568005?m… SOURCE: https://itunes.apple.com/us/app/soccer-physics/id898568005?m… SOURCE https://itunes.apple.com/us/app/soccer-physics/id898568005?m…   ", "source": "https://itunes.apple.com/us/app/soccer-physics/id898568005?mt=8", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["https://itunes.apple.com/us/app/soccer-physics/id898568005?mt=8", "https://itunes.apple.com/us/app/soccer-physics/id898568005?mt=8", "http://www.tuaw.com/2014/10/10/i-played-this-top-selling-game-100-times-and-this-is-what-i-lea/#", "http://www.tuaw.com/tag/apps/", "http://www.tuaw.com/tag/games/", "http://www.tuaw.com/tag/humor/", "http://www.tuaw.com/tag/soccer+physics/", "http://www.tuaw.com/tag/sports/", "https://itunes.apple.com/us/app/soccer-physics/id898568005?mt=8"], "title": "I played this top-selling game 100 times, and this is what I learned", "tags": ["apps", "games", "humor", "soccer physics", "sports"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/13/iphone-6-siblings-find-their-way-to-36-additional-territories-in/", "timestamp": "Oct 13th 2014 at 10:30AM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [], "content": "    Friday, October 17: China, India and Monaco Thursday, October 23: Israel Friday, October 24: Czech Republic, French West Indies, Greenland, Malta, Poland, Reunion Island and South Africa Thursday, October 30: Bahrain and Kuwait Friday, October 31: Albania, Bosnia, Croatia, Estonia, Greece, Guam, Hungary, Iceland, Kosovo, Latvia, Lithuania, Macau, Macedonia, Mexico, Moldova, Montenegro, Serbia, South Korea, Romania, Slovakia, Slovenia, Ukraine and Thailand VIEW TAGS VIEW TAGS        SOURCE: http://www.apple.com/pr/library/2014/09/30iPhone-6-iPhone-6-… SOURCE: http://www.apple.com/pr/library/2014/09/30iPhone-6-iPhone-6-… SOURCE http://www.apple.com/pr/library/2014/09/30iPhone-6-iPhone-6-…   ", "source": "http://www.apple.com/pr/library/2014/09/30iPhone-6-iPhone-6-Plus-Available-in-China-on-Friday-October-17.html", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.tuaw.com/2014/10/13/iphone-6-siblings-find-their-way-to-36-additional-territories-in/#", "http://www.tuaw.com/tag/apple/", "http://www.tuaw.com/tag/iphone+6/", "http://www.tuaw.com/tag/iphone+6+plus/", "http://www.tuaw.com/tag/launch/", "http://www.tuaw.com/tag/sales/", "http://www.apple.com/pr/library/2014/09/30iPhone-6-iPhone-6-Plus-Available-in-China-on-Friday-October-17.html"], "title": "iPhone 6 siblings find their way to 36 additional territories in October", "tags": ["apple", "iphone 6", "iphone 6 plus", "launch", "sales"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/13/fbi-director-thinks-apples-data-encryption-is-too-secure/", "timestamp": "Oct 13th 2014 at 1:30PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "\"fbi director thinks\" is a contradiction in terms. The director is too programmed to destroy our country to be able to think.\nJust tell the truth, Mr. Comey, sir; you are a terrorist.\n\nNow This:\n\nhttp://neworleans.indymedia.org/news/2014/10/20041.php\n\nhttp://prod.midiaindependente.org/en/red/2014/10/536243.shtml\n\nor:\n\nhttp://www.indymedia.org.nz/articles/3223", "timestamp": "2014-10-14T22:28:09.000Z", "author": "GeralSosbee"}, {"content": "a few people might use this for bad, so lets punish the other 10 million.... Logic...", "timestamp": "2014-10-14T17:54:41.000Z", "author": "daewootech"}, {"content": "The government is there to serve the people. Not the other way around. When government forgets this it may just be time for a new government.", "timestamp": "2014-10-14T16:48:06.000Z", "author": "HughesNet"}, {"content": "We are quickly becoming china and the way they(their government) wants the data accessible.  I find so many problems with all of this.  Business is already required through multiple regulations to encrypt emails, encrypt laptops, etc. The government does much or more of the same thing.   This is nothing but a natural continuation of the process to build what were things you had to buy into the product.   If Apple, Google, etc didn't do it then some other phone company would.", "timestamp": "2014-10-14T12:49:40.000Z", "author": "Big John"}, {"content": "He must have just huffed an entire Sherwin-Williams if he thinks we should be less secure for the government's sake.", "timestamp": "2014-10-14T12:43:29.000Z", "author": "afriend78"}, {"content": "wow this guy is sooooooooo dumb!", "timestamp": "2014-10-14T00:46:22.000Z", "author": "AndrewVonPeltIII"}, {"content": " Dear FBI director,\n\nMy data is MY data.  It is not YOUR data, it's My data.  I don't share MY data even with my friends or Family (Just ask AT&T, I am not on their stupid data sharing plan).  You don't get to see MY data, because even the government is full of criminals (See Politicians).  The government has not been trusted with data (See NSA Phone Metadata).  The Government should be moving their \"Computer Budget\" towards the vast paper mound backlog at the VA.  Lets worry about giving vets the treatment and respect they deserve for defending our country, and quit whining that companies we do trust are looking out for us by protecting our data from you!  It's called a Warrant, look into it sometime.", "timestamp": "2014-10-14T00:02:21.000Z", "author": "cloudtamer"}, {"content": "Fbi faccia il suo lavoro senza spiare la gente", "timestamp": "2014-10-13T21:22:39.000Z", "author": "GianlucaIacovone"}, {"content": "So, 99% are not criminals? In other words, 1.5 million iPhone customers just in 2013 are crooks?\n\n:)", "timestamp": "2014-10-13T21:22:20.000Z", "author": "colin.young"}, {"content": "@colin.young That's right... :) hhehe", "timestamp": "2014-10-14T16:13:13.000Z", "author": "Arnan"}, {"content": "I'd say \"tough\". Absent a warrant, the government has no rights to a citizen's secrets (or at least constitutionally, should have none) and even with a warrant, there is no legal obligation to make it easy for the government to gain those secrets (a good thing, since getting a overly broad warrant has gotten too easy in the last few decades). I've seen no evidence that legitimate investigations have actually been thwarted by an individual's use of encryption, so I have to take this as a desire for the FBI to readily get access to things they probably have no legal right to.", "timestamp": "2014-10-13T19:10:16.000Z", "author": "SteveAustin"}, {"content": "@SteveAustin I think the problem is with new super secure systems even with a warrant, data cannot be accessed.  It will make warrants useless.", "timestamp": "2014-10-13T19:59:45.000Z", "author": "barzia.j.tehrani"}, {"content": "@barzia.j.tehrani @SteveAustin Not really.  There has always been info that law enforcement has wanted that is hidden (it could just be something that someone knows and hasn't written down or has hidden in an unknown location).  As has always been the case, in response to a valid warrant, an individual is legally compelled to provide the info covered by the warrant (in this case, the info on the phone, by unlocking the phone).  As you say, having a warrant won't make the info magically available, but that has always been the case - the target of the warrant has always been able to refuse to provide desired info.  If the individual refuses to provide the info, that individual can be jailed for contempt until the info is provided - this is usually pretty good at compelling the revelation of the info.  As I said, this is the same as if there was no phone involved.  The only difference when encryption is added is that law enforcement can no longer access the info without making the effort public and getting a warrant - no more bypassing the Constitutional protections...", "timestamp": "2014-10-13T22:13:32.000Z", "author": "SteveAustin"}, {"content": "@SteveAustin @barzia.j.tehrani I agree that law enforcement attempt to get hidden data has backfired to the degree that most people don't trust them to only access data when warranted. \n\nHowever, I disagree that when warrant is issued, law inforcement can unlock the phone or force the individual to provide the info.  \n\nIn a recent supreme court case, an individual who refused to give his password to encrypted PGP hard disk won the case.  See Ramona Fricosu case. Supreme court decided that providing password to unlock computer is protected by 5th amendment and can be considered self incarceration.   Even though Ramona was charged with several compelling evidence against him, the data on his disk was never accessed.\n\nSince this ruling,  the law enforcement had a single choice, to go to the service providers and companies holding the data as a third party, specially when warrant is provided by the court.  Since providers are third party, 5th amendment does not apply.   What apple has done in response is to provide the ability to keep the encryption codes within the phone without sharing with apple, so in that way, apple can simply claim inability to access the data.\n\nThe bottom line is with the current system, any evidence stored in an encrypted iPhone, even in the case of most dangerous people, will never find its way to any court.  This is unlike other sort of evidence.  Even if it is kept in a safe, the safe can be taken and broke open, but not iPhone or other sort of fully encrypted disks with H/W support.", "timestamp": "2014-10-14T03:54:18.000Z", "author": "barzia.j.tehrani"}, {"content": "Instead of allowing Law Enforcement to argue \"What do you have to hide?\" we must instead ask \"Why do you want to know?\"\n\nThat's what the Constitution and Bill of Rights are all about. Law Enforcement is behaving the way the British did 250 years ago.", "timestamp": "2014-10-13T18:41:39.000Z", "author": "vdev"}, {"content": "You missed a perfect opportunity to link to \"Tuscan Whole Milk, 1 Gallon, 128 fl oz\" on Amazon here.", "timestamp": "2014-10-13T17:56:05.000Z", "author": "broroger"}, {"content": "But do they really mean that..? If you used private applications shared amongst only a few individuals in a close network then you could add extra layers that give an agency no documented basis to work with and then you are into real code-breaking again.. could this be a double bluff to trust in the standard..?", "timestamp": "2014-10-13T17:54:50.000Z", "author": "AndrewSmith"}, {"content": "This type of crap is hilarious fodder. They still have all the access they need. ", "timestamp": "2014-10-13T17:47:51.000Z", "author": "mrdavidpayne"}, {"content": "Mr Comey has forgotten that the foundation of Law Enforcement's relationship with the public is trust. As a direct result of their actions, that trust is just about non-existent.", "timestamp": "2014-10-13T17:41:55.000Z", "author": "TomMikele"}, {"content": "..", "timestamp": "2014-10-13T20:24:00.000Z", "author": "TaylorHively"}], "content": "  who spoke at length with 60 Minutes     aren't VIEW TAGS VIEW TAGS        SOURCE: http://www.cbsnews.com/news/fbi-director-james-comey-on-priv… SOURCE: http://www.cbsnews.com/news/fbi-director-james-comey-on-priv… SOURCE http://www.cbsnews.com/news/fbi-director-james-comey-on-priv…   ", "source": "http://www.cbsnews.com/news/fbi-director-james-comey-on-privacy-and-surveillance/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.cbsnews.com/news/fbi-director-james-comey-on-privacy-and-surveillance/", "http://www.tuaw.com/2014/10/13/fbi-director-thinks-apples-data-encryption-is-too-secure/#", "http://www.tuaw.com/tag/apple/", "http://www.tuaw.com/tag/fbi/", "http://www.tuaw.com/tag/ios/", "http://www.tuaw.com/tag/privacy/", "http://www.tuaw.com/tag/security/", "http://www.cbsnews.com/news/fbi-director-james-comey-on-privacy-and-surveillance/"], "title": "FBI director thinks Apple's data encryption is too secure", "tags": ["apple", "fbi", "ios", "privacy", "security"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/15/opera-still-exists-releases-opera-25-redesign-to-prove-it/", "timestamp": "Oct 15th 2014 at 2:00PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "There is no way to import your bookmarks from another browser. What were they thinking?", "timestamp": "2014-10-16T15:03:50.000Z", "author": "ninjapanda"}], "content": "    writes on the company's blog   the announcement post VIEW TAGS VIEW TAGS       SOURCE: http://blogs.opera.com/desktop/2014/10/visual-bookmarks-oper… SOURCE: http://blogs.opera.com/desktop/2014/10/visual-bookmarks-oper… SOURCE http://blogs.opera.com/desktop/2014/10/visual-bookmarks-oper…   ", "source": "http://blogs.opera.com/desktop/2014/10/visual-bookmarks-opera-for-computers/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://blogs.opera.com/desktop/2014/10/visual-bookmarks-opera-for-computers/", "http://blogs.opera.com/desktop/2014/10/visual-bookmarks-opera-for-computers/", "http://www.tuaw.com/2014/10/15/opera-still-exists-releases-opera-25-redesign-to-prove-it/#", "http://www.tuaw.com/tag/browsers/", "http://www.tuaw.com/tag/opera/", "http://www.tuaw.com/tag/opera+25/", "http://www.tuaw.com/tag/opera+browser/", "http://blogs.opera.com/desktop/2014/10/visual-bookmarks-opera-for-computers/"], "title": "Opera still exists, releases Opera 25 redesign to prove it", "tags": ["browsers", "opera", "opera 25", "opera browser"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/15/mac-app-store-frustrations-begin-to-boil-over/", "timestamp": "Oct 15th 2014 at 5:00PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "The only reason to buy through the MAS is to run the same software on my handful of Macs without paying for it multiple times. Everything else is downside, including having to buy the same software over and over because MAS doesn't support upgrades and castrates functionality of some utilities. Honestly, I wish that Parallels was only available in the MAS because their annual \"upgrades\" are a rip off.", "timestamp": "2014-10-16T13:40:41.000Z", "author": "MyronMarvin"}, {"content": "A free \"lite\" version works as a demo.\n\nConsumers don't expect upgrade pricing if the non-upgrade price is low for good software, and a new version actually is a big improvement instead of just a subterfuge for generating sales.", "timestamp": "2014-10-16T05:09:02.000Z", "author": "rt"}, {"content": "I agree these are issues that need to be addressed. Unfortunately, I think WWDC is the next opportunity we will have to make these changes. Shouldn't need to be, but it is the \"Apple Way\"", "timestamp": "2014-10-16T01:24:13.000Z", "author": "iSRS"}, {"content": "What you've stated here are the exact reasons why I left the MAS a long time ago when it comes to purchases of costly software. I'd like to try before I buy, my clothes as well as software I\"m willing to work with. If I'm not content with the software, there's no possibility to give it back unlike the jeans that don't fit, which I simply put back in the shelf. I purchased nearly all of my software directly from its producer, offering me special prices (bundles) and just-in-time updates when they're available. With MAS you often have to wait for weeks. In the worst case when the OS is updated, leaving your outdated software inoperative for quite a long time.", "timestamp": "2014-10-15T22:45:13.000Z", "author": "AlWalterMuc"}, {"content": "Helftone's post was good because it covered both sides of this equation.  Consumers are pretty happy with the Mac App Store.   The days of inputting long serial numbers or having apps restricted to just one computer are gone.  Having a purchase history is nice as well.  Helftone mentions this these consumer benefits which is what many complaint articles about the Mac App Store fail to do. \n\nThat being said the suggestion given about trials and upgrades sounds very plausible.  Apple's backend to the app store can calculate how much a \"complete my bundle\" will cost me based on the price I paid for the app[s].\n\nI see Trials and upgrades being necessary.  Just let the consumer hide updates they are not interested in purchasing.   Giving developers a bit of demographic data would also be nice. \n\nI think Apple's listening and will rectify these issues.  the Mac App Store is important.  It's convenient.  Let the developers have a bit of what they need. ", "timestamp": "2014-10-15T22:14:33.000Z", "author": "hmurchison"}, {"content": "@hmurchison Apple may have heard these issues, but they haven't done anything that indicates they are listening.  Particularly with support for demo's, upgrade pricing and the MANY MANY issues with sandboxing [both things developers would like to do, but Apple won't enable, and things that Apple says \"do it like this\", and when you do it like this, it doesn't work].\n\nThe other thing [same problem with the iOS store], is that as a developer, you need to take 100% of completely developing your application, then, at the end, submit it to Apple and hope that they will permit you to sell it through their store.  Actually, it's not as bad as iOS, as you can strip out some stuff, like sandboxing, and then sell it directly.", "timestamp": "2014-10-16T04:16:06.000Z", "author": "davester13"}], "content": "  revealed   The Mac App Store is approaching its fourth birthday, and it still has many of the same issues   quick to put it to an end     Daring Fireball VIEW TAGS VIEW TAGS      SOURCE: http://blog.helftone.com/mac-app-store-the-subtle-exodus/ SOURCE: http://blog.helftone.com/mac-app-store-the-subtle-exodus/ SOURCE http://blog.helftone.com/mac-app-store-the-subtle-exodus/   ", "source": "http://blog.helftone.com/mac-app-store-the-subtle-exodus/", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.tuaw.com/2014/10/13/bare-bones-software-pulling-next-bbedit-from-the-mac-app-store/", "http://www.tuaw.com/2010/10/20/app-store-for-mac-highlights-two-major-app-store-flaws/", "http://www.tuaw.com/2013/09/05/apple-stops-omni-group-from-offering-upgrade-pricing-for-mac-app/", "http://blog.helftone.com/mac-app-store-the-subtle-exodus/", "http://www.tuaw.com/2014/10/15/mac-app-store-frustrations-begin-to-boil-over/#", "http://www.tuaw.com/tag/apple/", "http://www.tuaw.com/tag/apps/", "http://www.tuaw.com/tag/mac-app-store/", "http://blog.helftone.com/mac-app-store-the-subtle-exodus/"], "title": "Mac App Store frustrations begin to boil over", "tags": ["apple", "apps", "mac-app-store"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/16/tim-cook-calls-iphone-6-launch-the-biggest-ever/", "timestamp": "Oct 16th 2014 at 1:15PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [], "content": "  iPhone VIEW TAGS VIEW TAGS      SOURCE: http://www.tuaw.com/tag/apple SOURCE: http://www.tuaw.com/tag/apple SOURCE http://www.tuaw.com/tag/apple   ", "source": "http://www.tuaw.com/tag/apple", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.tuaw.com/category/iPhone/", "http://www.tuaw.com/2014/10/16/tim-cook-calls-iphone-6-launch-the-biggest-ever/#", "http://www.tuaw.com/tag/apple/", "http://www.tuaw.com/tag/iphone+6/", "http://www.tuaw.com/tag/sales/", "http://www.tuaw.com/tag/apple"], "title": "Tim Cook calls iPhone 6 launch the biggest ever", "tags": ["apple", "iphone 6", "sales"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/16/apple-reminds-us-how-much-less-fragmented-ios-is-digs-at-androi/", "timestamp": "Oct 16th 2014 at 1:25PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [{"content": "I do think a question to be asked here is how many of the remaining 75% of android users have the KitKat update available to them through their manufacturer/service provider and how many of the remaining 52% have the update available to them but are still not updating to it.", "timestamp": "2014-10-16T17:44:24.000Z", "author": "vp"}, {"content": "@vp pretty much none.  manufacturers like samsung which is the primary android phone manufacturer only support the most recent generation, so devices like the S3 and S4 probably won't get the latest", "timestamp": "2014-10-16T18:14:44.000Z", "author": "AndrewVonPeltIII"}], "content": "    VIEW TAGS VIEW TAGS        SOURCE: http://www.tuaw.com/tag/ios+8 SOURCE: http://www.tuaw.com/tag/ios+8 SOURCE http://www.tuaw.com/tag/ios+8   ", "source": "http://www.tuaw.com/tag/ios+8", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["http://www.tuaw.com/2014/10/16/apple-reminds-us-how-much-less-fragmented-ios-is-digs-at-androi/#", "http://www.tuaw.com/tag/android/", "http://www.tuaw.com/tag/apple/", "http://www.tuaw.com/tag/fragmentation/", "http://www.tuaw.com/tag/ios/", "http://www.tuaw.com/tag/ios+8/", "http://www.tuaw.com/tag/ios+8"], "title": "Apple reminds us how much less fragmented iOS is, digs at Android", "tags": ["android", "apple", "fragmentation", "ios", "ios 8"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/07/31/runtastic-orbit-the-new-activity-tracker-on-the-block/", "timestamp": "Jul 31st 2014 at 11:00AM", "authorTwitter": "http://twitter.com/stevensande", "comments": [], "content": "  It seems like everyone is getting into the wearables market these days. There's Fitbit, Misfit, Nike Fuel Band, Withings Pulse, and about twenty others I can think of. So when a new tracker shows up on the market, it has to have some redeeming value to make it stand out from all of the others. Recently I was approached by Runtastic about doing a review of their new Orbit fitness band (US$119.99). Runtastic is primarily known for a number of activity tracking apps as well as a hardware line with heart rate monitors and bike accessories among the favorites. Runtastic Orbit number of activity tracking apps Design Highlights Design Highlights The Runtastic Orbit is a tiny device about 1.89 x .71 x .35 (at thickest point) inches (4.8 x 1.8 x .9 cm), weighing just .3 ounce (8.5 grams). It's made of a translucent smoked plastic, although you'll rarely see that plastic because the tracker is installed into either a wristband or belt clip. Runtastic provides two wristbands and a belt clip with each device -- the review unit came with black and blue silicone wristbands, although you can also purchase accessory bands in other colors. The front of the Orbit is dominated by three things: an white on black OLED display, a large and easily pushed metal button, and a tiny light sensor that is barely visible. The back contains the recessed contacts for the USB charger. The wristbands are quite comfortable -- important if you're going to wear the Orbit 24 hours a day -- and designed so that they're very easy to put on. I've tested some fitness trackers that I've wanted to throw out simply because the wristbands were almost impossible to put on, but that's certainly not the case with the Orbit band. The belt clip (seen in the image at the top of this page) is also well designed. When you place the Runtastic Orbit into the flexible silicone rubber clip, it's upside down, which means that you can actually read the display -- smart design, since you don't have to take the clip off in order to read it. The clip also has a rather strong grip, important for making sure that you don't lose the Orbit.  Runtastic Orbit Runtastic Orbit Runtastic Orbit                  Battery life in my testing was about one week. At the end of that time, I simply recharged the Orbit using the included USB charging cable. During charging, an animated display shows the battery \"filling up\", which is a nice visual cue. One end of the cable plugs into a standard USB port, while the other end has two small contacts embedded into a plastic head that has a strong magnet in it. The design of the prototype cable caused a problem, which I'll describe in the next section of this review. Finally, the device synchronizes with a new, free Runtastic Me iOS app. That app can pass along information about your exercise to the Runtastic or Runtastic Pro apps. Runtastic Runtastic Pro Functionality Highlights Functionality Highlights As a fitness tracker, the Runtastic Orbit does a really good job. It tracks steps taken, sleep duration, will show calories burned, can be used as a watch and alarm, and as noted above, it has good battery life compared to a lot of trackers. Part of this is due to the fact that you need to push the button to see the time or how many steps you've taken -- that display is off otherwise, helping extend that battery life. Each push of the button takes you to another screen -- first the time, then steps taken, then calories burned, and finally active minutes. The display is easy to read both in dark rooms and in full sunlight.   Most fitness trackers are designed to work hand-in-hand with a companion app, and in this case, the default app is Runtastic Me. Upon launching the app, it connects to the device via Bluetooth and synchronizes automatically. The display of Runtastic Me shows the current number of steps taken, active minutes during the present day, the number of calories burned, distance walked in miles or kilometers and, if you've enabled sleep tracking, the hours of sleep you had the previous evening. Runtastic Me Tapping on any of the items displays more detailed stats, including a timeline of when you were active. By swiping up you can move to the detail displays for the other tracked items, and for things like steps taken, a tap and hold on the display shows how many steps you had take up until the selected time. Enabling sleep tracking is quite simple. You simply hold down the button for three seconds as you're going to sleep, and a \"bed\" icon appears to let you know you're now tracking sleep. When you're waking up, just hold down the button for three seconds again, and a \"sunrise\" animation is your indication that sleep tracking has been turned off. Launch the Runtastic Me app, and you'll have almost immediate data on how well (or poorly) you slept the previous evening. Runtastic shows that the device will do \"mood tracking\", but it did not appear that the feature has been enabled yet. The Orbit is also supposed to do ambient lighting tracking so that you can make sure that you're getting enough sunlight each day, but that is also something that will come in the future with a firmware upgrade. As with most of the fitness trackers on the market, Orbit uses vibration alerts to wake you up in the morning (alarms are set through the app) or to prompt you to get moving. It's a good strong vibration, guaranteed to get your attention. One of the best features of the Runtastic Orbit is that it is complete waterproof. You can swim with it on, take a shower, or even go diving down to 300 feet with it. No other fitness tracker is waterproof to that extent, and a number (Nike FuelBand SE, Withings Pulse O2, Fitbit Flex, Jawbone UP24) are either just water-resistant or have no ability to withstand water at all. I was quite impressed with the fact that the Orbit lives up to its battery life of 7 days. That's almost exactly what I got from a full charge. The accuracy of the Orbit's step tracker is up for debate. I matched the steps taken with another activity tracker as well as my iPhone 5s, and when I used the belt clip, the numbers were almost identical. I did see lower step numbers when I used the wristband, which was a bit of an anomaly. Charging with the prototype magnetic charging cable (blue cable below) caused a problem at one point. The magnet in the cable made it stick to the metal end of another cable, shorting it out and melting the charging cable. I reported the issue to Runtastic; they are redesigning the charger cable (I was using a prototype) and will have a revised version with all shipping Orbits. I would still recommend unplugging the cable when it is not in use.   Conclusion Conclusion Runtastic's Orbit activity tracker is another welcome entry to an increasingly crowded market. At $119.99, it's slightly more expensive than the Nike FuelBand SE, Fitbit Flex, Misfit Shine and the Polar Loop, less expensive than the Jawbone UP24 and Garmin Vivofit, and the same price as the Withings Pulse O2. Waterproof to 300 feet, with some planned features (mood and ambient light tracking) that don't exist on most competitors, a choice of how the device is worn, good battery life, and a well-designed app, the Orbit is a solid competitor. Two factors -- the lower step count when worn as a wristband and two advertised features that are not working at this time -- are keeping me from giving the Orbit a top score. Rating: 3 stars out of 4 stars possible Rating: 3 stars out of 4 stars possible    VIEW TAGS VIEW TAGS          SOURCE: http://www.runtastic.com/orbit SOURCE: http://www.runtastic.com/orbit SOURCE http://www.runtastic.com/orbit   ", "source": "http://www.runtastic.com/orbit", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://runtastic.com/", "http://www.runtastic.com/orbit", "https://itunes.apple.com/us/artist/runtastic/id336599885", "http://www.tuaw.com/photos/runtastic-orbit/", "http://www.tuaw.com/photos/runtastic-orbit/2808473/#!slide=2808473", "http://www.tuaw.com/photos/runtastic-orbit/2808474/#!slide=2808474", "http://www.tuaw.com/photos/runtastic-orbit/2808475/#!slide=2808475", "http://www.tuaw.com/photos/runtastic-orbit/2808476/#!slide=2808476", "http://www.tuaw.com/photos/runtastic-orbit/2808477/#!slide=2808477", "https://itunes.apple.com/us/app/runtastic-gps-running-walking/id336599882?mt=8", "https://itunes.apple.com/us/app/runtastic-pro-gps-running/id366626332?mt=8", "https://itunes.apple.com/app/id893528604?mt=8&ign-mpt=uo%3D4", "http://www.tuaw.com/2014/07/31/runtastic-orbit-the-new-activity-tracker-on-the-block/#", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/fitness+tracker/", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/review/", "http://www.tuaw.com/tag/runtastic/", "http://www.tuaw.com/tag/runtastic+orbit/", "http://www.tuaw.com/tag/wearable/", "http://www.runtastic.com/orbit"], "title": "Runtastic Orbit: The new activity tracker on the block", "tags": ["features", "fitness tracker", "iOS", "review", "runtastic", "runtastic orbit", "wearable"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/03/wellograph-watch-activity-tracking-with-style-and-sapphire/", "timestamp": "Oct 3rd 2014 at 6:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [{"content": "What is this... a poor man's Pebble??", "timestamp": "2014-10-05T05:05:27.000Z", "author": "gacbmmml"}, {"content": "@gacbmmml Actually it's pricier than the Pebble... looks like a Pebble with sapphire screen to me. Pebble just dropped their prices to $99 for Pebble Solid and $199 for Pebble Steel as well", "timestamp": "2014-10-06T02:01:23.000Z", "author": "Truffol"}], "content": "There are a ton of fitness and activity monitors out in the wild now that could basically be described as the good, the bad, and the ugly. Some of the fitness monitors I've reviewed over the past few years have been amazing, with accuracy, good battery life, and interaction with apps that track your activity and inspire you to do more. A handful have been just awful, with battery life issues, crashes, and apps that weren't thought out. And there were the ugly devices - and I mean they were awful to look at. The Wellograph (US$349) certainly isn't an ugly device, and it's one of the more innovative fitness devices I've seen so far. But like so many others fitness monitors that are rushing to market, it seems to be a work in progress.    Wellograph Specifications Specifications Dimensions: 1.65 x 1.30 x 0.5 inch (42 x 33 x 12.5 mm) Weight: 3.52 ounce (55 grams) Display: 1.26 inch low-power LCD with backlight Sensors: 9-axis motion sensor, Tri-LED heart rate sensor Connectivity: Bluetooth 4.0 LE Battery life: 7 days per charge (210 mAh) Waterproof: 5 ATM, up to 50 meters or 160 feet Materials: Anodized aluminum lower case, stainless steel upper case, spherical sapphire crystal. Design   The case comes in two different finishes: Silver Satin with a brown leather strap and Black Chrome with a black leather strap. Additional straps are available for $49 each either in leather or as a black nylon Nato strap. One of the big selling points of the Wellograph is that it uses a sapphire crystal - the exact material that was expected on the iPhone 6 models (it does exist on the Touch ID home button) and that will be on several models of the Apple Watch. That should help to keep the crystal from being scratched, and in testing for almost a month the crystal remained scratch-free despite some accidental bumps. The user interface is controlled by two buttons on the right side of the case, which might make it difficult for left-handed people to use and wear. Unlike the Apple Watch, the display operates only in one orientation while being worn so it can't be flipped.   Wellograph Wellograph Wellograph                  Most fitness tracker UIs use a single button to cycle through a number of screens. The two buttons on the Wellograph are used to scroll through text-based menus on the device and select those menu items. While the UI is rather easy to pick up and understand, I found that changing the settings on the device was cumbersome. It's definitely a lot easier to do that through a smartphone app like so many other devices. The display is kind of schizophrenic, at times both wonderful and annoying. Outside in bright sunshine, it's a joy to use, with large white letters appearing on a stark black background. On cloudy days or in a darkened room, you'll find it's difficult to read the display without using the backlight. Once selected in the settings, the backlight turns on while you're pushing buttons, then fades to darkness over a few seconds. At the bottom of the default digital time display are three small icons. One shows the relative battery charge level, the middle one is the current day of the month, and the last is a heart-shaped icon that visually displays how far you've come toward your daily exercise goal. The Wellograph app tries to steer you to do 30 minutes of moderate to vigorous exercise daily. The strap on the Wellograph is a standard leather strap that is quite comfortable. For those who are more active or wish to take the device swimming (it is waterproof!) there's a nylon Nato band. For charging, there's a magnetic dock that the watch rests on, displaying a \"sideways clock\" while the device is getting power. is Function Function Part of my comment about the Wellograph feeling like a work in progress has to do with how new the device is; during my weeks of testing, I was notified about three firmware updates. Those are done through the iPhone app via Bluetooth The Bluetooth syncing seems just plain odd. Most devices have a simple way to sync, where you just push a button and the device contacts your iPhone and begins a sync. Not here. Syncing the Wellograph involves launching the app and tapping sync, at which time you're asked to \"Select an accessory.\" Huh? I finally realized that it was trying to find the Wellograph, which it didn't do automatically because the device turns Bluetooth off in between syncs. To turn it on, you turn to the watch, and then have to punch the two buttons a total of ten times to cycle through menus and turn Bluetooth on just long enough for your iPhone and Wellograph to talk to each other. Sure, turning off Bluetooth is a great way to make sure that your device isn't constantly burning up battery power, but I'd much rather charge the device once a day than have to punch buttons every time I want to sync the device. Even my $35 Virgin Pulse Max has a better sync design than this, and it has a battery that lasts for about six months! With it, I just punch one button seven times quickly until the screen says \"Sync\", launch the app, and the two devices communicate and transfer info. Done. To achieve that 7-day per charge battery life, the Wellograph seems to make some other sacrifices: the display backlight that's only on when you're pushing buttons and a \"power saver mode\" that you have to remember to get out of by pushing a button. The first day of use I didn't know I had to push that button to \"wake\" the Wellograph, so it didn't track my steps until much later in the day when I actually \"woke\" it. Since that power saver mode seems to enable itself when there's not too much activity (it thinks you're asleep), the Wellograph enabled the mode many times while I was working at my desk. Since I didn't look at the watch face obsessively, I wasn't aware until later that it wasn't tracking my steps. A step tracker is worthless unless it's constantly tracking your steps. One feature that is pretty cool is the heart rate sensor - a similar sensor will be on the back of every Apple Watch as well. All you need to do to measure heart rate is to push buttons until you get to the BPM screen. Initially, a heart shape pulsed along with my heart until it got an average reading, at which it stopped and displayed that reading. On occasion I found that it would \"beat\" but not display a beats-per-minute figure, which made me wonder if I had just died. Not good. After one of the firmware updates, the heart rate sensor changed to an actual EKG-like heart trace. I compared the Wellograph BPM figure with that from both another smartphone-enabled device - a Withings Blood Pressure Monitor - and with the time-tested manual method. In all cases, the heart rate was within a few BPM, so it looks like their sensor is right on the money.     Wellograph App Wellograph App Wellograph App                  The app displays a home screen with three big icons on it: Activity, Heart, and Sessions. Activity shows your current step and calorie count, as well as a daily, weekly and monthly total. I found it rather odd that when I tried to change my daily step goal in the user profile settings, it took quite a while for the change to \"take\", leading me to wonder if the app had frozen. One other oddity with the settings: regardless of how many times I put in my birthdate, it kept reverting to one year later days after I'd save it. I guess being a year younger is a benefit of using Wellograph. I also found the Wellograph's step counting function to be well off of what two other devices - my iPhone 6 Plus and that cheap Virgin Pulse device - agreed on. It was always somewhat on the low side to the tune of almost 20 - 25 percent of my step total. I've noticed similar low numbers for some other wrist-worn fitness trackers - the Misfit Shine, for example - while other devices have been right on the money. The Heart display is fascinating, showing the amount of cardio time you've put in and displaying light, moderate and vigorous activity by percentage of total. When you swipe the screen to the left, you get a display of your heart rate - high, low, and average for a day, week or month.   Conclusion Conclusion After several weeks of putting the Wellograph through the daily routine, I found that it is one of the more comfortable fitness trackers I've worn, and it looks good. It gets the advertised one week of battery life, but at the expense of display clarity indoors, continuous tracking, and ease of syncing. The bottom line, though, is that there are a number of less expensive fitness trackers that do the same job as well or better than the Wellograph. With the Apple Watch on the horizon, able to do health tracking as well as running a variety of apps to do just about anything and display all of those on a vibrant color screen, is there really a place in the market for a $349 monochrome device that performs just a handful of functions? At a lesser price, I could see a place for Wellograph for those people who don't necessarily want an app-enabled battery hog on their wrists. If you need a device that wouldn't look out of place in a boardroom, that's waterproof, and that just tracks fitness factors, then Wellograph might be for you. Rating: 2-1/2 stars out of 4 stars possible Rating: 2-1/2 stars out of 4 stars possible   VIEW TAGS VIEW TAGS          SOURCE: https://wellograph.com/ SOURCE: https://wellograph.com/ SOURCE https://wellograph.com/   ", "source": "https://wellograph.com/", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://www.wellograph.com/", "http://www.tuaw.com/photos/wellograph-1/", "http://www.tuaw.com/photos/wellograph-1/2994295/#!slide=2994295", "http://www.tuaw.com/photos/wellograph-1/2994296/#!slide=2994296", "http://www.tuaw.com/photos/wellograph-1/2994297/#!slide=2994297", "http://www.tuaw.com/photos/wellograph-1/2994298/#!slide=2994298", "http://www.tuaw.com/photos/wellograph-1/2994299/#!slide=2994299", "http://www.tuaw.com/photos/wellograph-app/", "http://www.tuaw.com/photos/wellograph-app/2994241/#!slide=2994241", "http://www.tuaw.com/photos/wellograph-app/2994242/#!slide=2994242", "http://www.tuaw.com/photos/wellograph-app/2994243/#!slide=2994243", "http://www.tuaw.com/photos/wellograph-app/2994244/#!slide=2994244", "http://www.tuaw.com/photos/wellograph-app/2994245/#!slide=2994245", "http://www.tuaw.com/2014/10/03/wellograph-watch-activity-tracking-with-style-and-sapphire/#", "http://www.tuaw.com/tag/accessories/", "http://www.tuaw.com/tag/features/", "http://www.tuaw.com/tag/fitness+tracker/", "http://www.tuaw.com/tag/iOS/", "http://www.tuaw.com/tag/review/", "http://www.tuaw.com/tag/wellograph/", "http://www.tuaw.com/tag/Wellograph+Wellness+Watch/", "https://wellograph.com/"], "title": "Wellograph Watch: Activity tracking with style and sapphire", "tags": ["accessories", "features", "fitness tracker", "iOS", "review", "wellograph", "Wellograph Wellness Watch"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/16/crowdfunding-roundup-smart-yoga-mats-and-dumb-looking-pyramids/", "timestamp": "Oct 16th 2014 at 2:00PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [], "content": "  Each week, TUAW provides readers with an update on new or significant crowdfunded Apple-related projects in the news. While our policy is to not go into detail on items that haven't reached at least 80 percent of their funding goal, this update is designed to give readers a heads-up on projects they might find interesting enough to back.  Each week, TUAW provides readers with an update on new or significant crowdfunded Apple-related projects in the news. While our policy is to not go into detail on items that haven't reached at least 80 percent of their funding goal, this update is designed to give readers a heads-up on projects they might find interesting enough to back. So many of the Kickstarter and Indiegogo campaigns we cover are power-related, primarily because we all use our devices so much that we're constantly running the batteries down (well, except for those of us with the iPhone 6 Plus, of course...). AMPY is quite a different product, capturing kinetic energy from your movements, convering it into power, and then giving you a way to connect your device for a quick charge. Sound far-fetched? It's not. The project is already funded to the tune of 127 percent with 24 days to go. So many of the Kickstarter and Indiegogo campaigns we cover are power-related, primarily because we all use our devices so much that we're constantly running the batteries down (well, except for those of us with the iPhone 6 Plus, of course...). AMPY is quite a different product, capturing kinetic energy from your movements, convering it into power, and then giving you a way to connect your device for a quick charge. Sound far-fetched? It's not. The project is already funded to the tune of 127 percent with 24 days to go. AMPY   Hey, here's an idea: grab a ruggedized solid state drive and strap it to your wrist. No, unfortunately I'm not making this up - this is KUFF, AKA \"the future of wearable storage.\" But hey, it will be Open Source! And have a strap! Sorry, why not just get a regular portable SSD and carry it in your pocket? Obviously I'm not \"sharing the vision\" with this team. With 37 days to go, KUFF is about 6 percent funded. Hey, here's an idea: grab a ruggedized solid state drive and strap it to your wrist. No, unfortunately I'm not making this up - this is KUFF, AKA \"the future of wearable storage.\" But hey, it will be Open Source! And have a strap! Sorry, why not just get a regular portable SSD and carry it in your pocket? Obviously I'm not \"sharing the vision\" with this team. With 37 days to go, KUFF is about 6 percent funded. KUFF   An intelligent Yoga mat... Yep, it has sensors, and a smartphone or tablet app \"guides you through a series of audio and visual indicators, allowing a more detailed and insightful Yoga practice.\" At 189 percent of funding with 14 days left, I don't think SmartMat needs my backing. An intelligent Yoga mat... Yep, it has sensors, and a smartphone or tablet app \"guides you through a series of audio and visual indicators, allowing a more detailed and insightful Yoga practice.\" At 189 percent of funding with 14 days left, I don't think SmartMat needs my backing. SmartMat   And here's another \"smart\" object. A lot of companies have had smart power outlets for years; the Smart Outlet by Newbeem is another one. Plug it in, and you have three outlets... Only one is Wi-Fi enabled, and there are two others that are \"regular\". All are surge protected, so there's that. The project is about 70 percent funded with about 8 days to go. And here's another \"smart\" object. A lot of companies have had smart power outlets for years; the Smart Outlet by Newbeem is another one. Plug it in, and you have three outlets... Only one is Wi-Fi enabled, and there are two others that are \"regular\". All are surge protected, so there's that. The project is about 70 percent funded with about 8 days to go. Smart Outlet by Newbeem   We've seen some microscope lenses and kits for iPhone and iPad before, but never has there been an affordable high magnification microscope lens. Dotlens wants every student to have his or her own microscope. Attach these little dot lenses (hence the name) to the camera of your device, and you have either a 15 power or 120 power microscope in your hands. That 120x Dotlens has a minimum resolution of 1 micrometer! Sadly, this campaign is running a bit behind, with only 21 percent raised with less than two weeks to go. You can help by backing the project for as little as $10 (15x) or $25 (120x). We've seen some microscope lenses and kits for iPhone and iPad before, but never has there been an affordable high magnification microscope lens. Dotlens wants every student to have his or her own microscope. Attach these little dot lenses (hence the name) to the camera of your device, and you have either a 15 power or 120 power microscope in your hands. That 120x Dotlens has a minimum resolution of 1 micrometer! Sadly, this campaign is running a bit behind, with only 21 percent raised with less than two weeks to go. You can help by backing the project for as little as $10 (15x) or $25 (120x). Dotlens   Some people are concerned about the fact that the iSight camera on their Mac can theoretically be hacked, thus providing someone with a view of your home or office without your knowledge. Rather than using the time-honored tradition of placing electrical tape over the camera, the Nope project creates a nice, professional-looking magnetic cover that you can take off when you need to actually use the camera. This is funded big time: 10,242 percent funded with over a month to go. Get in on the action for $5 or more. Some people are concerned about the fact that the iSight camera on their Mac can theoretically be hacked, thus providing someone with a view of your home or office without your knowledge. Rather than using the time-honored tradition of placing electrical tape over the camera, the Nope project creates a nice, professional-looking magnetic cover that you can take off when you need to actually use the camera. This is funded big time: 10,242 percent funded with over a month to go. Get in on the action for $5 or more. Nope   Sometimes I feel like I've seen certain campaigns before, simply because they remind me of another Kickstarter or Indiegogo project. That was the case with StandStand, which fellow TUAW editor Dave Caolo pointed out to me. It's actually a pretty nifty product -- a portable wood standing desk that weighs less than two pounds but has been tested to withstand over 900 pounds of weight. It's funded to the tune of over 550 percent with five days to go, so StandStand is ready for launch. You can still get in on the fun as a backer. Sometimes I feel like I've seen certain campaigns before, simply because they remind me of another Kickstarter or Indiegogo project. That was the case with StandStand, which fellow TUAW editor Dave Caolo pointed out to me. It's actually a pretty nifty product -- a portable wood standing desk that weighs less than two pounds but has been tested to withstand over 900 pounds of weight. It's funded to the tune of over 550 percent with five days to go, so StandStand is ready for launch. You can still get in on the fun as a backer. StandStand   Occasionally, I have to call out a campaign for public shaming just for the sheer joy of pointing out some questionable design choices. P-VOX is this week's winner, and what's really bizarre is that this combo pyramid, speaker, desk lamp, analog clock and charger actually has a chance of making it to production. Yeah, it's 73 percent funded with less than a week to go. Why do I have a bad feeling we're going to see infomercials for P-VOX on late night TV? Occasionally, I have to call out a campaign for public shaming just for the sheer joy of pointing out some questionable design choices. P-VOX is this week's winner, and what's really bizarre is that this combo pyramid, speaker, desk lamp, analog clock and charger actually has a chance of making it to production. Yeah, it's 73 percent funded with less than a week to go. Why do I have a bad feeling we're going to see infomercials for P-VOX on late night TV? P-VOX   We'll be back next Thursday for another roundup of crowdfunded projects that you can support or ignore. Many thanks again to Hal Sherman for providing some tips about new and exciting projects, and if you're aware of any other crowdfunded Apple-related projects, be sure to let us know about them through the Tip Us button at the upper right of the TUAW home page for future listing on the site. VIEW TAGS VIEW TAGS         SOURCE: http://tuaw.com/tag/crowdfunding SOURCE: http://tuaw.com/tag/crowdfunding SOURCE http://tuaw.com/tag/crowdfunding   ", "source": "http://tuaw.com/tag/crowdfunding", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["https://www.kickstarter.com/projects/1071086547/ampy-power-your-devices-from-your-motion", "https://www.kickstarter.com/projects/armenc/kuff-the-future-of-wearable-storage", "https://www.indiegogo.com/projects/smartmat-the-world-s-first-intelligent-yoga-mat", "https://www.kickstarter.com/projects/2010526530/smart-outlet", "https://www.indiegogo.com/projects/dotlens-the-10-smartphone-microscope", "https://www.kickstarter.com/projects/1893116150/nope-live-free?ref=category_popular", "https://www.kickstarter.com/projects/1875488582/standstand?ref=nav_search", "https://www.kickstarter.com/projects/539305215/p-vox-the-ultimate-powerhouse-for-your-desk", "http://www.tuaw.com/2014/10/16/crowdfunding-roundup-smart-yoga-mats-and-dumb-looking-pyramids/#", "http://www.tuaw.com/tag/AMPY/", "http://www.tuaw.com/tag/crowdfunding/", "http://www.tuaw.com/tag/indiegogo/", "http://www.tuaw.com/tag/kickstarter/", "http://www.tuaw.com/tag/KUFF/", "http://www.tuaw.com/tag/smartmat/", "http://tuaw.com/tag/crowdfunding"], "title": "Crowdfunding Roundup: Smart Yoga mats and dumb-looking pyramids", "tags": ["AMPY", "crowdfunding", "indiegogo", "kickstarter", "KUFF", "smartmat"]},
{"author": "Kelly Hodgkins", "url": "http://www.tuaw.com/2014/10/16/apple-updates-the-mac-mini-line-with-improved-hardware-499-sta/", "timestamp": "Oct 16th 2014 at 2:25PM", "authorTwitter": "http://twitter.com/kellyhodgkins", "comments": [], "content": "Apple today announced it was refreshing its Mac mini desktops, the first update the product line has seen in two years. The new Mac minis will include a 4th-generation Intel Core processor, Intel Iris and HD Graphics 5000, PCIe flash storage, 802.11ac WiFi, and two Thunderbolt 2 ports. Apple is billing the Mac mini as the world's most energy efficient desktop.   Mac  The Mac mini is available today with a starting price tag of $499, which is $100 off the price of previous entry-level model. VIEW TAGS VIEW TAGS     SOURCE: http://www.apple.com/mac-mini/ SOURCE: http://www.apple.com/mac-mini/ SOURCE http://www.apple.com/mac-mini/   ", "source": "http://www.apple.com/mac-mini/", "authorUrl": "http://www.tuaw.com/editor/kelly-hodgkins/", "urlsInContent": ["http://www.tuaw.com/category/Mac/", "http://www.tuaw.com/2014/10/16/apple-updates-the-mac-mini-line-with-improved-hardware-499-sta/#", "http://www.tuaw.com/tag/Mac/", "http://www.tuaw.com/tag/Mac+mini/", "http://www.apple.com/mac-mini/"], "title": "Apple updates the Mac mini line with improved hardware, $499 starting price tag", "tags": ["Mac", "Mac mini"]},
{"author": "Mike Wehner", "url": "http://www.tuaw.com/2014/10/09/mac-ception/", "timestamp": "Oct 9th 2014 at 4:00PM", "authorTwitter": "http://twitter.com/MikeWehner", "comments": [], "content": "    Paul McCoubrie VIEW TAGS VIEW TAGS      SOURCE: https://www.flickr.com/photos/paulmccoubrie/8092014981/in/ph… SOURCE: https://www.flickr.com/photos/paulmccoubrie/8092014981/in/ph… SOURCE https://www.flickr.com/photos/paulmccoubrie/8092014981/in/ph…   ", "source": "https://www.flickr.com/photos/paulmccoubrie/8092014981/in/photolist-dQbChi-dEQi4X-dCKALZ-dmSziM-dk4G8F-dUG4Qu-dSYW3A-dSYUF3-dSYUPw-dSYWsJ-dSTmCB-dSYUUS-dSYVyu-dSYVVs-dSTjM8-dSYYK5-dSTnKp-dSYZeL-dSYXyE-dSDtQe-dSK3bu-dSDu96-dSCETz-dSJbNm-dSCDqa-dSJcGU-dSCE5", "authorUrl": "http://www.tuaw.com/editor/mike-wehner/", "urlsInContent": ["https://www.flickr.com/photos/paulmccoubrie/8092014981/in/photolist-dQbChi-dEQi4X-dCKALZ-dmSziM-dk4G8F-dUG4Qu-dSYW3A-dSYUF3-dSYUPw-dSYWsJ-dSTmCB-dSYUUS-dSYVyu-dSYVVs-dSTjM8-dSYYK5-dSTnKp-dSYZeL-dSYXyE-dSDtQe-dSK3bu-dSDu96-dSCETz-dSJbNm-dSCDqa-dSJcGU-dSCE54-dSCCGg-dRu9bw-dRmZ83-dQXSUg-dPKNCL-dP25xJ-dP1Va5-dLbpM2-dK4YGe-dKaswW-dHvKho-dGiyJX-dE9Z59-dBpsWJ-dAEsRH-dwatjg-du64xK-drMsHS-dnAFCH-dj1Q1G-dcTyNn-dcpN2b-dcpMP7", "http://www.tuaw.com/2014/10/09/mac-ception/#", "http://www.tuaw.com/tag/flickr/", "http://www.tuaw.com/tag/mac/", "http://www.tuaw.com/tag/photos/", "https://www.flickr.com/photos/paulmccoubrie/8092014981/in/photolist-dQbChi-dEQi4X-dCKALZ-dmSziM-dk4G8F-dUG4Qu-dSYW3A-dSYUF3-dSYUPw-dSYWsJ-dSTmCB-dSYUUS-dSYVyu-dSYVVs-dSTjM8-dSYYK5-dSTnKp-dSYZeL-dSYXyE-dSDtQe-dSK3bu-dSDu96-dSCETz-dSJbNm-dSCDqa-dSJcGU-dSCE5"], "title": "Mac-ception", "tags": ["flickr", "mac", "photos"]},
{"author": "Steven Sande", "url": "http://www.tuaw.com/2014/10/13/bare-bones-software-pulling-next-bbedit-from-the-mac-app-store/", "timestamp": "Oct 13th 2014 at 12:30PM", "authorTwitter": "http://twitter.com/stevensande", "comments": [{"content": "I'd been a BBEdit user for 10 years, but last year I've switched to Sublime Text. \n\nBBEdit just stopped evolving since BBEdit 8. For such a long time it's still missing critical features like language based syntax color, two column editing, multiple inserting, naming factory, Git integration, JavaDoc/PHPDoc integration, smooth ctags integration, standard library auto-completion, online syntax linter, user-define build system, and project-based settings.\n\nFortunately, we now have better tool for HTML/CSS like Coda2; we have better tool for Ruby like TextMate; we have better tool for PHP/Python like Komodo; we have better tool for markup text like Markdown; and we have the all-mighty Sublime Text 2. ", "timestamp": "2014-10-14T02:05:30.000Z", "author": "ulyssesric"}, {"content": "What I'd read elsewhere was the the current version will remain in the App Store and existing App Store customers will be able to upgrade, as always.\n\nA better summary is at: http://sixcolors.com/post/2014/10/bbedit-at-max-q/", "timestamp": "2014-10-13T19:02:46.000Z", "author": "leehinde"}, {"content": "Well, kinda ticks me off. I've had it for years and years. At the last upgrade cycle, I went with \"App Store\" version since that's where things seemed to be heading.\n\nI wonder what BB will do at the next cycle? Maybe they'll have a plan - they have been good about that in the past.", "timestamp": "2014-10-13T18:38:13.000Z", "author": "vdev"}, {"content": "In the Mac App Store, there is NO upgrade pricing. That can kill a software developer. To date, Apple has not cared.", "timestamp": "2014-10-13T17:12:18.000Z", "author": "riclf"}, {"content": "Money lost on his part. Not like he couldn't just release one openly on his site and to App store and catch both customer sources.. /shrug Seems more of a media grab look at me bucking a trend... \n\nNice of him to leave us current App store customers in a lurch.. ", "timestamp": "2014-10-13T16:58:45.000Z", "author": "adrayven"}, {"content": "@adrayven But how it it a lurch if it's still available? He didn't quit developing it...?", "timestamp": "2014-10-13T17:01:19.000Z", "author": "LaneJasper"}, {"content": "@LaneJasper @adrayven rebuying the license directly to keep with updates. Anyone who just bought with App store is out of luck... If they only recently bought it they can get refund I guess. that will be a limited opportunity though for only a few.", "timestamp": "2014-10-13T17:03:12.000Z", "author": "adrayven"}, {"content": "@adrayven I'd think there's record of initial purchase and a simple email would grant further updates without re-purchasing. Haven't heard of any dev that wouldn't honor that.", "timestamp": "2014-10-13T17:06:27.000Z", "author": "LaneJasper"}, {"content": "@LaneJasper @adrayven Yes, but that requires the end user to KNOW that he's left the App store.. which many just rely on the automatic updates to handle.. soooooo.. yea. ", "timestamp": "2014-10-13T17:07:51.000Z", "author": "adrayven"}, {"content": "@adrayven Just email bbedit support and they'll move the license. I bought BBEdit sometime in the 90s, and emailed them about recovering my license. They sent it to me, and I got upgrade pricing for one of the newer versions.\n\nIf you use BBEdit you should be a professional. Be a professional and email support instead of complaining about theoreticals on a forum.", "timestamp": "2014-10-13T17:38:50.000Z", "author": "mannyv"}, {"content": "@adrayven I doubt it will cost them a penny. Every $1.00 they got before is now worth $1.30. Any loss in volume will be note than made up for by no longer paying Apple's cut. Then take out the frustration, stress and time to comply with Apple's demands and they are likely to come out on top. Bare Bones software is not a \"for everyone\" product. They might lose the occasional amateur user, but that's about it. As an iTunes content producer, I do have some experience. I have a much more general product so I need them to reach my customers. They don't.\n\nAnd how are they leaving any customer in a lurch? It doesn't affect your use of the software at all. All if affects is where you get the software from.", "timestamp": "2014-10-13T17:49:24.000Z", "author": "TomMikele"}], "content": "  Over the weekend at the Çingleton conference in Montreal, Rich Siegel of Bare Bones Software made a presentation in which he gave his reasons why the next version of his company's flagship product - BBEdit - won't be sold on the Mac App Store. Çingleton Bare Bones Software BBEdit For many people, this move seems counterintuitive. Wouldn't a developer want his or her app to be just a click away from purchase on the Mac App Store? As noted by Çingleton attendee and SixColors.com creator Jason Snell, Siegel wasn't frustrated with the things most people would believe were the reason for quitting the Mac App Store. It's wasn't Apple's 30 percent cut of profits, the lack of a relationship with his App Store customers, the marketing challenges or even the craziness of following Apple's submission guidelines. SixColors.com creator Jason Snell Instead, it was the cumulative effect of all of these frustrations, most of which occur at the end of the development cycle just before shipping a product. Siegel came to the realization that the extra stress and frustration just weren't worth the hassle of being in the Mac App Store, so for at least the immediate future, BBEdit will be available only from the Bare Bones Software website. all Siegel doesn't count out the possibility of returning to the App Store in the future if some of the irritations are worked out. But at the present time, the company can concentrate on continually improving its popular editing app, keeping in touch with its customers, and developing new features without the extra added stress. VIEW TAGS VIEW TAGS        SOURCE: http://sixcolors.com/post/2014/10/bbedit-at-max-q/ SOURCE: http://sixcolors.com/post/2014/10/bbedit-at-max-q/ SOURCE http://sixcolors.com/post/2014/10/bbedit-at-max-q/   ", "source": "http://sixcolors.com/post/2014/10/bbedit-at-max-q/", "authorUrl": "http://www.tuaw.com/editor/steven-sande/", "urlsInContent": ["http://cingleton.com/", "http://barebones.com/", "http://barebones.com/products/bbedit/", "http://sixcolors.com/post/2014/10/bbedit-at-max-q/", "http://www.tuaw.com/2014/10/13/bare-bones-software-pulling-next-bbedit-from-the-mac-app-store/#", "http://www.tuaw.com/tag/bare+bones+software/", "http://www.tuaw.com/tag/bbedit/", "http://www.tuaw.com/tag/cingleton/", "http://www.tuaw.com/tag/Mac/", "http://www.tuaw.com/tag/mac+app+store/", "http://sixcolors.com/post/2014/10/bbedit-at-max-q/"], "title": "Bare Bones Software pulling next BBEdit from the Mac App Store", "tags": ["bare bones software", "bbedit", "cingleton", "Mac", "mac app store"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/09/niners-qb-colin-kaepernick-fined-10-000-for-wearing-beats-by-dr/", "timestamp": "Oct 9th 2014 at 10:00PM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [{"content": "Talking about being owned! LOL!\n\nWhy is a Football organization controlling what people wear? Its understandable for them to control the rules related to Football - but this is just gotten RIDICULOUS!\n\nThis whole stupid deal could end up backfiring for both the NFL and Bose! And honestly they'd deserve it!", "timestamp": "2014-10-11T00:52:32.000Z", "author": "saci68"}, {"content": "First of all they look like douchebags wearing ANY headphones before the game.\nSecond, Bose probably paid a lot of money to the NFL to be the exclusive provider just like Nike did for the equipment so I'm sure the players knew this. This is obviously a PR stunt that Kaeperdick knew very well.", "timestamp": "2014-10-10T19:43:40.000Z", "author": "nachorrin"}, {"content": "Apple should be a smartass and pay the fines. See how long the two can battle it out. ", "timestamp": "2014-10-10T17:26:55.000Z", "author": "JBSlough"}, {"content": "@JBSlough That's what happened with Brian Urlacher, I'm pretty sure of, when he drank a different beverage during an interview, and I think wore their logo on clothing. Urlacher never paid a dime, from what I remember.", "timestamp": "2014-10-10T17:29:26.000Z", "author": "woody24"}, {"content": "@JBSlough Why?  The almost certainly get more benefit from the fact that they aren't involved, that the players made their product choice without any support from Apple.  It's the same as use of Apple gear in movies or on TV - if people know that Apple doesn't pay for product placement but their stuff gets used anyway, it makes that use seem even better.", "timestamp": "2014-10-10T19:49:39.000Z", "author": "SteveAustin"}, {"content": "Also, who gets the money from the fines? The NFL? I'm guessing Bose had to pay the NFL for the exclusive rights to it. But if the NFL keeps getting all these fine, they're going to come out way ahead. ", "timestamp": "2014-10-10T17:23:36.000Z", "author": "woody24"}, {"content": "I see this deal hurting Bose in the long run. ", "timestamp": "2014-10-10T17:21:58.000Z", "author": "woody24"}, {"content": "If I had that kinda money like those players do, I'd take any fine if that meant I'd be making a firm statement against deals like Bose made.", "timestamp": "2014-10-10T16:52:13.000Z", "author": "Arnan"}, {"content": "@Arnan If I was the maker of any other brand, I'd pay the fine for them, since it's gotten much more publicity than Bose got. Well worth the cost of advertising. ", "timestamp": "2014-10-10T17:20:50.000Z", "author": "woody24"}, {"content": "@woody24 @Arnan Who uses Bose headphones anyway... I didn't even know they still made them.", "timestamp": "2014-10-10T21:23:42.000Z", "author": "Arnan"}, {"content": " He should donate it to charity on behalf of the NFL and Bose", "timestamp": "2014-10-10T15:03:02.000Z", "author": "gideonb"}, {"content": "So where is the line drawn between corporate sponsorship and individual right to free speech? It is getting out of control and it's going to bite the NFL and Bose in the butt. I know Bose just lost a potential customer here by trying to lock out competition on the television.", "timestamp": "2014-10-10T14:07:31.000Z", "author": "PaulDuke"}, {"content": "@PaulDuke The line is drawn at the point the player is participating in a work (NFL) related activity, which a post game interview certainly is.  If the player is at home, or out with friends, or on vacation, or whatever, the NFL has no say (about this, anyway).  But while they are at work, the NFL does.  This is no different that most employees, whose employers can dictate much of their behavior at work - in particular, employers can ban activities that harm the business, which violating the rules of an exclusive sponsorship deal (and the large amount of money it brings in) certainly can do.  Whether such sponsorship deals (and the bad press they can generate, as in this case) are really worth it to the sponsor (or for that matter, to the recipient of the sponsorship) is a separate question, though I think years of study have shown that these sorts of flaps blow over quickly, while the sponsorships are worth a lot of money to both sides.", "timestamp": "2014-10-10T19:45:19.000Z", "author": "SteveAustin"}, {"content": "Stupid fine, but headphones of any make have no place in team sports, especially at the professional level. I saw players wearing them before a preseason game and realized that the level of NFL player arrogance and big shotism has reached a new high. ", "timestamp": "2014-10-10T13:49:27.000Z", "author": "mr.marc"}, {"content": "i would recommend not starting a 'news' item (or any sentence, for that matter) with the phrase \"on account of.\"  it's not professional.", "timestamp": "2014-10-10T13:31:50.000Z", "author": "mdriegler"}, {"content": "If they want to pay the fines, let them wear anything they want. Or just don't interview them.", "timestamp": "2014-10-10T13:00:28.000Z", "author": "PaulGans"}, {"content": "Totally stupid…", "timestamp": "2014-10-10T12:09:46.000Z", "author": "sonyc91"}, {"content": "Delicious cake is immensely loved and admired by all. It adds extra special moments in the life. Make all special moments of any celebration bright and beautiful with a tasty cake and express your best love and affection. Send Cakes to Chennai at right price through any online shopping store and express your best intimate bond of love and affection.", "timestamp": "2014-10-10T06:37:05.000Z", "author": "sutapadutta"}, {"content": "They're still lousy headphones.  Buying a name is all you're doing.  You wouldn't know what good sound sounded like if it blew out your ear drums.", "timestamp": "2014-10-10T02:31:20.000Z", "author": "Mark"}, {"content": "That's beside the point. Greedy NFL shouldn't be able to tell players what they can \"wear\" outside of a game.", "timestamp": "2014-10-10T04:14:50.000Z", "author": "nitrama"}, {"content": "@nitrama I'm not saying it isn't stupid (because holy crap, it totally is), but participating in an interview directly after a game is likely covered under what they do as employees of the NFL. More or less, they *do* have the right to dictate that sort of thing, in so much as the NFL gets to dictate what people wear (i.e., players don't get to wear a different uniform just because they feel like it).\n\nIf it was a player walking thru the airport, or something similarly unrelated to their actual contracted employment, that'd be totally different.", "timestamp": "2014-10-10T05:56:41.000Z", "author": "evula"}, {"content": "@evula I'm saying the NFL shouldn't be able to make exclusivity deals like this.  Are players forced to wear the same brand of shoes?\n\nKap got in trouble before the 2013 season at a party (== not at work) for wearing a Dolphins baseball cap.  I thought that was a bit edgy, but I also felt that the flak he took for that was pretty severe.", "timestamp": "2014-10-10T06:38:31.000Z", "author": "nitrama"}, {"content": "@nitrama @evula Yes, as a matter of fact, they _are_ forced to wear the same shoes - the NFL has a sponsorship deal with Nike, and all players are required to wear Nike shoes (and other logo'ed apparel)  at all game related activities.  AFAIK, they will be fined if they wear other brands, or of they cover up the Nike logos (which they might if they have a personal sponsorship deal with another brand).\n\nThis isn't completely surprising - there is a lot of money involved in these exclusive sponsorship deals (which the NFL, as a private entity is allowed to make), and when that is the case, companies get pretty pissy about protecting their investments.  This isn't just the NFL - all sports leagues (US and other - try playing in a FIFA tournament wearing or using logo'ed gear from someone other than a sponsor and see how far you get) and I assume any other organization that gets major sponsorship money will have as part of the sponsorship agreement limitations on (recognizable) use of items from the sponsor's competitors by people affiliated with the organization.  This isn't a free speech thing - this is a money thing and an employment agreement thing.  Most companies have rules about what an employee can do (at least on company time) to \"support\" (in various ways) a competitor, and the players get paid much better than most to follow such rules.  It is just that in the players' case, the enforcement of such rules takes place in a much more public way than most.", "timestamp": "2014-10-10T19:05:02.000Z", "author": "SteveAustin"}], "content": "  NFL last week banned players     was fined $10,000 pink Beats by Dre headphones        also isn't too enthused VIEW TAGS VIEW TAGS      SOURCE: http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-… SOURCE: http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-… SOURCE http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-…   ", "source": "http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-san-francisco-49ers-fined-10k-beats-dre-headphones", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://www.tuaw.com/2014/10/04/nfl-bans-players-from-wearing-beats-headphones-on-camera/", "http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-san-francisco-49ers-fined-10k-beats-dre-headphones", "https://twitter.com/thefootballgirl/status/520303198796775424", "http://thebiglead.com/2014/10/06/espn-showed-richard-sherman-wearing-beats-by-dre-headphones/", "http://www.tuaw.com/2014/10/09/niners-qb-colin-kaepernick-fined-10-000-for-wearing-beats-by-dr/#", "http://www.tuaw.com/tag/beats/", "http://www.tuaw.com/tag/bose/", "http://www.tuaw.com/tag/sports/", "http://espn.go.com/nfl/story/_/id/11671032/colin-kaepernick-san-francisco-49ers-fined-10k-beats-dre-headphones"], "title": "Niners QB Colin Kaepernick fined $10,000 for wearing Beats by Dre headphones", "tags": ["beats", "bose", "sports"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/16/apple-pay-goes-live-on-october-20-many-new-retail-partners-and/", "timestamp": "Oct 16th 2014 at 1:33PM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [], "content": "   Apple Pay          VIEW TAGS VIEW TAGS     SOURCE: http://www.tuaw.com/2014/10/16/tuaw-liveblog-of-the-october-… SOURCE: http://www.tuaw.com/2014/10/16/tuaw-liveblog-of-the-october-… SOURCE http://www.tuaw.com/2014/10/16/tuaw-liveblog-of-the-october-…   ", "source": "http://www.tuaw.com/2014/10/16/tuaw-liveblog-of-the-october-16-2014-apple-event/", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://www.tuaw.com/tag/Apple+Pay/", "http://www.tuaw.com/2014/10/16/apple-pay-goes-live-on-october-20-many-new-retail-partners-and/#", "http://www.tuaw.com/tag/apple+pay/", "http://www.tuaw.com/tag/pay/", "http://www.tuaw.com/2014/10/16/tuaw-liveblog-of-the-october-16-2014-apple-event/"], "title": "Apple Pay goes live on October 20, many new retail partners and banks on board", "tags": ["apple pay", "pay"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/11/leaked-walgreens-memo-points-to-apple-pay-launch-on-october-18/", "timestamp": "Oct 11th 2014 at 6:30PM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [{"content": "How exciting..\n\nCongrats, only one more week and the iPhone 6 will catch up to all the folks with an NFC capable Android phone who started paying at Walgreens and McDonald's TWO YEARS AGO..", "timestamp": "2014-10-13T00:42:59.000Z", "author": "JorgTheElder"}, {"content": "@JorgTheElder Except that the NFC in Android devices actually passes your entire credit card info across that signal where apple sends a one time key based on encrypted information. No need to worry about data breaches like what happened to Target a few years back where millions of credit card numbers were stolen.", "timestamp": "2014-10-13T03:52:15.000Z", "author": "shawnrask"}, {"content": "@shawnrask @JorgTheElder Not wanting to feed the original troll here but that's actually not how Google Wallet works. Wallet gives you a virtual Mastercard - these are the details that are passed to the retailer at purchase. Wallet then takes the amount from your funding source - your real credit card or bank account. They don't pass any of your real credit card details to anyone.", "timestamp": "2014-10-13T07:20:41.000Z", "author": "mj291278"}], "content": "   obtained by MacRumors extremely secure incentivized to upgrade   from The Daily Dot Apple Pay website   VIEW TAGS VIEW TAGS     SOURCE: http://www.macrumors.com/2014/10/11/walgreens-apple-pay-octo… SOURCE: http://www.macrumors.com/2014/10/11/walgreens-apple-pay-octo… SOURCE http://www.macrumors.com/2014/10/11/walgreens-apple-pay-octo…   ", "source": "http://www.macrumors.com/2014/10/11/walgreens-apple-pay-october-18/", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://www.macrumors.com/2014/10/11/walgreens-apple-pay-october-18/", "http://www.tuaw.com/2014/10/02/apple-pay-an-in-depth-look-at-whats-behind-the-secure-payment/", "http://www.tuaw.com/2014/10/09/why-apple-pay-is-poised-to-succeed-where-others-failed/", "http://www.dailydot.com/technology/apple-pay-token-process/", "https://www.apple.com/apple-pay/", "http://www.tuaw.com/2014/10/11/leaked-walgreens-memo-points-to-apple-pay-launch-on-october-18/#", "http://www.tuaw.com/tag/apple+pay/", "http://www.tuaw.com/tag/walgreens/", "http://www.macrumors.com/2014/10/11/walgreens-apple-pay-october-18/"], "title": "Leaked Walgreens memo points to Apple Pay launch on October 18", "tags": ["apple pay", "walgreens"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/13/apple-pay-setup-process-detailed-in-newly-leaked-screenshots/", "timestamp": "Oct 13th 2014 at 11:00AM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [{"content": "can someone take a photo of my credit card and then start using it?!", "timestamp": "2014-10-13T17:20:51.000Z", "author": "AlistairFlood"}, {"content": "@AlistairFlood You don't just take a photo. It is also going to post an authorization to your account for a random amount which you have to have access to the account to get. Then you have to enter in that amount to verify the card.If they are like Coin you will also swipe the mag stripe with a headphone mounted card reader.", "timestamp": "2014-10-14T17:09:33.000Z", "author": "HughesNet"}, {"content": "Will someone explain this to me? Why is it important that all these banks are signing on for apple pay? Can I ONLY use cards from those banks? I thought I remember Apple saying at the announcement that people would be able to use the credit cards they already had on file with iTunes, as apple pay credit cards. Is that only true if they are backed by one of these banks? If you can't just use any credit card with apple pay, then why is everyone talking about the fact that Apple already has 8 billion credit cards signed up? ", "timestamp": "2014-10-13T16:03:47.000Z", "author": "MatthewSlaughter"}, {"content": "Those are a couple of interesting questions. While someone needs to be able to translate the token to a credit card number and to validate the one time key, I would think that would be the transaction network (Visa, MasterCard, etc.) rather than the individual card issuers. Maybe it's related to who is actually going to be holding the fraud liability. And as you say, the cards that Apple is holding for iTunes don't necessarily have any tie to the institutions that are participating in Apple Pay (and shouldn't really have any connection to Apple Pay at all).", "timestamp": "2014-10-13T19:20:53.000Z", "author": "SteveAustin"}], "content": "   9to5Mac has obtained        Interestingly, the Passbook/Apple Pay settings will have deep ties to the credit card companies and banks involved in the service. For each connected credit card/bank, users will have a simple list of recent transactions, quick access to download an accompanying App Store app, the ability to contact their bank, the option to receive push notifications, and a display of both their credit card's number and the unique device account number. Another cool tidbit is that if a credit card expires, Passbook will automatically update the card with the new expiration date from the credit card company. Users will not need to delete and re-add the card; they will simply receive a push notification alerting them that the changed occurred. Interestingly, the Passbook/Apple Pay settings will have deep ties to the credit card companies and banks involved in the service. For each connected credit card/bank, users will have a simple list of recent transactions, quick access to download an accompanying App Store app, the ability to contact their bank, the option to receive push notifications, and a display of both their credit card's number and the unique device account number. Another cool tidbit is that if a credit card expires, Passbook will automatically update the card with the new expiration date from the credit card company. Users will not need to delete and re-add the card; they will simply receive a push notification alerting them that the changed occurred.   internal memo from Walgreens      set up to be extremely secure   VIEW TAGS VIEW TAGS    SOURCE: http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retai… SOURCE: http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retai… SOURCE http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retai…   ", "source": "http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retailers-begin-training-as-service-launches-at-apple-hq/", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retailers-begin-training-as-service-launches-at-apple-hq/", "http://www.tuaw.com/2014/10/11/leaked-walgreens-memo-points-to-apple-pay-launch-on-october-18/", "http://www.tuaw.com/2014/10/02/apple-pay-an-in-depth-look-at-whats-behind-the-secure-payment/", "http://www.tuaw.com/2014/10/13/apple-pay-setup-process-detailed-in-newly-leaked-screenshots/#", "http://www.tuaw.com/tag/apple+pay/", "http://9to5mac.com/2014/10/12/apple-pay-setup-detailed-retailers-begin-training-as-service-launches-at-apple-hq/"], "title": "Apple Pay setup process detailed in newly leaked screenshots", "tags": ["apple pay"]},
{"author": "Yoni Heisler", "url": "http://www.tuaw.com/2014/10/13/gt-advanced-technologies-contract-with-apple-included-a-50-mil/", "timestamp": "Oct 13th 2014 at 1:00PM", "authorTwitter": "http://twitter.com/edibleapple", "comments": [{"content": "I do find this interesting. I am a manufacturer and I want to do business in the sector. I discuss a business deal with Apple, and would really like to be a supplier for them. However, I read the contract (or rather, my lawyers read the contract) and there is a section that is obviously \"oppressive and burdensome\". Isn't the answer that I tell Apple that I cannot do business with them and don't sign the contract?", "timestamp": "2014-10-13T18:03:36.000Z", "author": "ijimbot"}], "content": " Originally spotted by the Financial Times Details of Apple's non-disclosure agreements, which suppliers are not even allowed to acknowledge, have already emerged in court filings by GT Advanced Technologies, including the $50m penalty the iPhone maker imposes for any leak of product information. Details of Apple's non-disclosure agreements, which suppliers are not even allowed to acknowledge, have already emerged in court filings by GT Advanced Technologies, including the $50m penalty the iPhone maker imposes for any leak of product information.   GTAT articulated VIEW TAGS VIEW TAGS    SOURCE: http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144… SOURCE: http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144… SOURCE http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144…   ", "source": "http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144feab7de.html#axzz3G2EEfoKd", "authorUrl": "http://www.tuaw.com/editor/yoni-heisler/", "urlsInContent": ["http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144feab7de.html#axzz3G2EEfoKd", "http://www.tuaw.com/2014/10/10/gt-advanced-hopes-to-cease-operations-this-year-calls-contract/", "http://www.tuaw.com/2014/10/13/gt-advanced-technologies-contract-with-apple-included-a-50-mil/#", "http://www.tuaw.com/tag/GT+Advanced+Technologies/", "http://www.ft.com/intl/cms/s/0/2fe3d93e-51ed-11e4-b55e-00144feab7de.html#axzz3G2EEfoKd"], "title": "GT Advanced Technologies' contract with Apple included a $50 million penalty for leaking future product info", "tags": ["GT Advanced Technologies"]}]